{
  "2026-02-19": [
    {
      "title": "Predicting onset of symptomatic Alzheimer's disease with plasma p-tau217 clocks.",
      "authors": "Kellen K Petersen, Marta Milà-Alomà, Yan Li...",
      "abstract": "Predicting not just if, but also when, cognitively unimpaired individuals are likely to develop onset of Alzheimer's disease (AD) symptoms would be useful to clinical trials and, eventually, clinical practice. Although clock models based on amyloid and tau positron emission tomography have shown promise in predicting the onset of AD symptoms, a model based on plasma biomarkers would be more accessible. Using longitudinal plasma %p-tau217 (the ratio of phosphorylated to non-phosphorylated tau at position 217) from two independent cohorts (n = 258 and n = 345), clock models were used to estimate the age at plasma %p-tau217 positivity. The estimated age at plasma %p-tau217 positivity was associated with the age at onset of AD symptoms (adjusted R",
      "published": "2026-02-19",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41714746/",
      "source": "PubMed",
      "relevance_score": 23.1,
      "matched_keywords": [
        "Alzheimer's disease",
        "amyloid",
        "tau",
        "plasma"
      ],
      "journal": "Nature medicine",
      "volume": "",
      "issue": "",
      "is_high_impact": true,
      "archived_at": "2026-02-19T22:21:30.363672"
    },
    {
      "title": "Deep learning models identify brain changes during the progression of Alzheimer's disease.",
      "authors": "Jinhui Sun, Jing-Dong J Han, Weiyang Chen",
      "abstract": "Alzheimer's disease (AD) is an irreversible neurodegenerative disorder whose progression is closely associated with time. However, most diagnostic models are based on single time-point data, overlooking longitudinal disease characteristics. Structural magnetic resonance imaging (sMRI) has been widely utilized in the study of AD. To address the need for multi-time series analysis in longitudinal AD research and the integration of features from different brain tissues, we propose a Multi-Branch Fusion Channel Attention Network (MBFCA-Net) for disease diagnosis. This network leverages the temporal correlations across longitudinal scans for effective AD detection. We further conduct retrospective interpretability analysis to quantify the contributions of brain regions across disease stages. This enables a detailed investigation of dynamic changes in brain regions associated with AD and normal aging. The results indicate that the importance of regions such as the amygdala, parahippocampal gyrus, and temporal lobe undergoes dynamic changes throughout the progression of AD. Furthermore, AD-related voxel clusters exhibit a developmental trend, shifting from the hippocampus to the temporal lobe and transitioning from a dispersed to a more aggregated distribution. Our study provides novel insights into the longitudinal patterns of AD-related changes, offering valuable contributions to early diagnosis and pathological understanding of the disease.",
      "published": "2026-02-19",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41714635/",
      "source": "PubMed",
      "relevance_score": 15.6,
      "matched_keywords": [
        "Alzheimer's disease",
        "brain"
      ],
      "journal": "NPJ systems biology and applications",
      "volume": "",
      "issue": "",
      "is_high_impact": true,
      "archived_at": "2026-02-19T22:21:33.846821"
    }
  ],
  "2026-02-20": [
    {
      "title": "Hallucinations and delusions are associated with elevated tau PET signal independent of age, clinical severity, and amyloid burden.",
      "authors": "Aubrey S Johnson, Hannah Houlihan, Galen Ziaggi...",
      "abstract": "Psychosis in Alzheimer's disease (AD) is associated with worse outcomes, yet no established biomarkers exist for early diagnosis and intervention. We compared tau positron emission tomography (PET) burden across older individuals with and without psychotic symptoms.",
      "published": "2026-01-01",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41696647/",
      "source": "PubMed",
      "relevance_score": 24.2,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "tau"
      ],
      "journal": "Alzheimer's & dementia (Amsterdam, Netherlands)",
      "volume": "18",
      "issue": "1",
      "is_high_impact": true,
      "archived_at": "2026-02-20T11:11:36.516309"
    },
    {
      "title": "Refining Alzheimer's disease biological diagnosis with plasma biomarkers: Resolving p-tau217 \"gray zone\" with p-tau181 integration.",
      "authors": "Giulia Giacomucci, Silvia Maria Rita Tabbì, Assunta Ingannato...",
      "abstract": "Blood-based biomarkers offer a less invasive and more scalable alternative to cerebrospinal fluid (CSF) analysis and amyloid-positron emission tomography (PET) for the biological diagnosis of Alzheimer's disease (AD). Among blood-based biomarkers (BBMs), plasma phosphorylated tau217 (p-tau217) has shown the highest accuracy, although intermediate (\"gray zone\") values remain challenging to interpret.",
      "published": "2026-01-01",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41700306/",
      "source": "PubMed",
      "relevance_score": 20.6,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "plasma"
      ],
      "journal": "Alzheimer's & dementia (Amsterdam, Netherlands)",
      "volume": "18",
      "issue": "1",
      "is_high_impact": true,
      "archived_at": "2026-02-20T11:11:52.476958"
    },
    {
      "title": "Clinical amyloid and tau positron emission tomography imaging in Alzheimer's disease: image interpretation in the era of anti-amyloid therapies.",
      "authors": "Gregory Mathoux, Elif Harput, Débora E Peretti...",
      "abstract": "The introduction of disease-modifying anti-amyloid therapies has shifted the role of positron emission tomography (PET) imaging in Alzheimer's disease from confirming diagnosis to actively guiding clinical decision-making within the AT(N) framework.",
      "published": "2026-02-20",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41715292/",
      "source": "PubMed",
      "relevance_score": 16.2,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "tau"
      ],
      "journal": "Current opinion in neurology",
      "volume": "",
      "issue": "",
      "is_high_impact": false,
      "archived_at": "2026-02-20T11:12:15.914525"
    }
  ],
  "2026-02-24": [
    {
      "title": "Integration over reduction: multimodal PET and fluid biomarkers in Alzheimer's disease and beyond.",
      "authors": "Marina Bluma, Konstantinos Chiotis, Agneta Nordberg",
      "abstract": "Biomarker-based Alzheimer's disease (AD) diagnosis has shifted clinical practice from syndromic, dementia-stage diagnosis to a biologically defined framework anchored in amyloid positron emission tomography (PET) and cerebrospinal fluid (CSF) assays. However, binary amyloid/tau status does not capture disease complexity, stage, and the impact of co-existing neuropathologies. Here, we review in vivo human PET-fluid biomarker studies in AD and related neurological disorders.",
      "published": "2026-02-24",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41725559/",
      "source": "PubMed",
      "relevance_score": 13.7,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "tau"
      ],
      "journal": "Current opinion in neurology",
      "volume": "",
      "issue": "",
      "is_high_impact": false,
      "archived_at": "2026-02-24T13:48:04.180915"
    }
  ]
}