{
  "metadata": {
    "created_at": "2025-09-18T21:37:32.688267",
    "weeks_covered": 1,
    "keywords_used": [
      "Alzheimer's disease",
      "PET",
      "MRI",
      "dementia",
      "amyloid",
      "tau",
      "brain",
      "plasma"
    ],
    "data_sources": {
      "pubmed": true
    },
    "search_mode": "Brief (PubMed: 1000, Others: 500)",
    "total_papers": 20,
    "papers_per_week": 20,
    "date_range": "2025-09-18 to 2025-09-18"
  },
  "weeks": {
    "today": {
      "week_info": {
        "week_number": 1,
        "start_date": "2025-09-18T00:00:00",
        "end_date": "2025-09-18T00:00:00",
        "week_label": "Today (2025-09-18)"
      },
      "papers": [
        {
          "title": "Design of Tau Aggregation Inhibitors Using Iterative Machine Learning and a Polymorph-Specific Brain-Seeded Fibril Amplification Assay.",
          "authors": "Alessia Santambrogio, Robert I Horne, Michael A Metrick...",
          "abstract": "The aggregation of tau into amyloid fibrils is associated with Alzheimer's disease (AD) and related tauopathies. Since different tauopathies are characterized by the formation of distinct tau fibril morphologies, it is important to combine the search of tau aggregation inhibitors with the development of in vitro tau aggregation assays that recapitulate aggregation as it may occur in the brain. Here we address this problem by reporting an in vitro tau aggregation assay in which AD brain homogenates are used to seed the generation of first-generation tau fibrils in a polymorph-specific manner under quiescent conditions. These fibrils are then used to create amyloid seed libraries from which second-generation kinetic assays can be readily performed. Using this strategy, we illustrate an iterative machine learning method for the identification of small molecules for the polymorph-specific inhibition of the in vitro formation of tau fibrils. We further show that the small molecules selected by this procedure are potent inhibitors in a",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40964862/",
          "source": "PubMed",
          "relevance_score": 4.4,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "Journal of the American Chemical Society",
          "volume": "",
          "issue": "",
          "pmid": "40964862",
          "doi": "10.1021/jacs.5c12812",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Two-dimensional materials can inhibit Aβ fibrillation in Alzheimer's disease.",
          "authors": "Anupam Ghosh, Titas Kumar Mukhopadhyay, Ayan Datta",
          "abstract": "Alzheimer's disease (AD) is a major life-limiting neurodegenerative disorder caused by extracellular aggregation of amyloid β (Aβ) peptides. This forms amyloid plaques in the brain resulting in dementia and even causing death. In spite of great efforts towards developing therapies to cure AD, unfortunately, treatment is often ineffective. Herein, we investigate the possibility of state-of-the-art two-dimensional (2D) nanomaterials to treat AD by evaluating their potential to perturb and disrupt Aβ peptide aggregates. The adsorption mechanism for a pre-formed Aβ fibril is carefully studied on five 2D materials, namely graphene, hexagonal boron nitride (h-BN), h2D-C",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40856257/",
          "source": "PubMed",
          "relevance_score": 4.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid",
            "brain"
          ],
          "journal": "Physical chemistry chemical physics : PCCP",
          "volume": "27",
          "issue": "36",
          "pmid": "40856257",
          "doi": "10.1039/d5cp01461a",
          "categories": [
            "PubMed",
            "Amyloid beta-Peptides",
            "Alzheimer Disease",
            "Graphite",
            "Boron Compounds",
            "Humans"
          ]
        },
        {
          "title": "Exploring the role of multi-pathogen infections in Alzheimer's disease: A case-control study.",
          "authors": "Victor Garcia-Bustos, Marta Dafne Cabanero-Navalon, Carmen Lloret-Sos...",
          "abstract": "Alzheimer's disease (AD) is a leading cause of dementia. Following the discovery of the amyloid's antimicrobial properties, research has focused on infectious agents as potential contributors. This study investigates the role of multi-pathogen infections in AD by analyzing serological and molecular microbiologic markers in serum and cerebrospinal fluid (CSF).",
          "published": "2025-12-01",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40944945/",
          "source": "PubMed",
          "relevance_score": 3.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid"
          ],
          "journal": "Virulence",
          "volume": "16",
          "issue": "1",
          "pmid": "40944945",
          "doi": "10.1080/21505594.2025.2560904",
          "categories": [
            "PubMed",
            "Humans",
            "Alzheimer Disease",
            "Male",
            "Case-Control Studies",
            "Female"
          ]
        },
        {
          "title": "Bone marrow B lymphopoiesis accelerates early cerebral amyloid pathology.",
          "authors": "Jing Zhang, Wenting Fang, Hanchen Liu...",
          "abstract": "Bone marrow is a major source of hematogenous cells that orchestrate brain immunity. However, alterations in the bone marrow hematopoietic system in patients with Alzheimer's disease (AD) and their potential impacts on neuroinflammation and cerebral β-amyloid (Aβ) pathology remain unknown. Here, we report that Aβ accumulates within the bone marrow of patients with AD and is particularly concentrated in the central nervous system-surrounding bones. In 5 × FAD and APP/PS1 mice, two classic mouse AD models, Aβ accumulates within the skull bone marrow prior to substantial cerebral Aβ deposits. Flow cytometry and cell tracking analyses demonstrated that these AD mice exhibit enhanced bone marrow hematopoiesis in B lymphoid lineages, specifically an increase in age-associated B cells (ABCs), accompanied by heightened output of these cells into the brain parenchyma. Furthermore, intracranial Aβ injection into IL-6 knockout mice revealed that Aβ promotes B lymphocyte generation, particularly ABCs, via IL-6 signaling. Single-cell sequencing analysis following intracerebroventricular ABCs injection, combined with in vitro microglial culture studies, demonstrated that bone marrow-derived ABCs directly augment microglial reactivity, ultimately exacerbating Aβ neuropathology and cognitive deficits in AD models. Notably, blockade of IL-6R restricts B-cell activity and ABCs in the bone marrow, delays cerebral Aβ pathology and improves cognition. Our findings reveal the potential involvement of bone marrow-derived B cells in the early cerebral amyloid pathology in two mouse AD models and suggest that these B cells may serve as potential therapeutic candidates for patients with AD.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40962797/",
          "source": "PubMed",
          "relevance_score": 3.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid",
            "brain"
          ],
          "journal": "Signal transduction and targeted therapy",
          "volume": "10",
          "issue": "1",
          "pmid": "40962797",
          "doi": "10.1038/s41392-025-02419-0",
          "categories": [
            "PubMed",
            "Animals",
            "Mice",
            "Alzheimer Disease",
            "B-Lymphocytes",
            "Lymphopoiesis"
          ]
        },
        {
          "title": "68Ga-FAPI-04: A Powerful Tool for Detecting Subcentimeter Metastases of Intrahepatic Cholangiocarcinoma.",
          "authors": "Yu Sun, Jianjun Jiang, Qingyuan Meng...",
          "abstract": "A 53-year-old woman presented with subcentimeter liver metastases 18 months after resection of intrahepatic cholangiocarcinoma. 18F-FDG PET/CT imaging demonstrated no FDG avid in the lesions, whereas 68Ga-FAPI-04 PET identified 3 metastases with high FAPI uptake. On conventional or contrast-enhanced MRI evaluation, each sequence detected just 1-2 lesions. Our case highlights the advantage and superior sensitivity of 68Ga-FAPI-04 over 18F-FDG and MRI in detecting subcentimeter metastases of intrahepatic cholangiocarcinoma.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40963177/",
          "source": "PubMed",
          "relevance_score": 3.0,
          "matched_keywords": [
            "PET",
            "MRI"
          ],
          "journal": "Clinical nuclear medicine",
          "volume": "",
          "issue": "",
          "pmid": "40963177",
          "doi": "10.1097/RLU.0000000000006114",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Benefits and challenges of multi-delay arterial spin labeling in clinical practice: measuring perfusion and cerebrovascular reactivity in intracranial steno-occlusive disease.",
          "authors": "Simone M Uniken Venema, Alex Bhogal, Jan Willem Dankbaar...",
          "abstract": "Magnetic resonance imaging (MRI) techniques have now widely replaced positron emission tomography (PET) as the modality of choice to assess cerebrovascular reactivity (CVR) and other hemodynamic parameters in intracranial steno-occlusive disease (ISOD), such as moyamoya vasculopathy (MMV). Therefore, radiologists should be aware of the choices in imaging techniques and potential pitfalls in the imaging interpretation. We developed a protocol based on multi-delay arterial spin labeling (ASL), with which, since its implementation in routine clinical practice in 2018, approximately 100 patients have been evaluated for CVR and other parameters. The protocol demonstrates clinical feasibility and utility, allowing detailed cerebral hemodynamic evaluations of individual patients that are useful for clinical decision-making. While multi-delay ASL offers benefits compared to single-delay ASL in patients with arterial transit delays, it is not completely insensitive to transit times, and further methodological improvements could mitigate this issue in the near future. Potential pitfalls in imaging acquisition and interpretation include artefacts due to motion, susceptibility, and misalignment in imaging registration, inadequate labeling, and the effects of anesthesia on CVR. This work serves as a practical guide for clinicians, radiologists, and MRI experts seeking to implement these advanced imaging methods in their institutions. CRITICAL RELEVANCE STATEMENT: Our MRI protocol, based on multi-delay ASL with a vascular challenge of acetazolamide, can be successfully used for hemodynamic assessments of patients with ISOD in clinical settings. KEY POINTS: We developed and implemented a protocol using acetazolamide-augmented multi-delay ASL for hemodynamic assessments in patients with steno-occlusive disease. Obtaining hemodynamic maps from ASL source data requires pre- and post-processing steps using customized toolboxes. CVR, if decreased, indicates hemodynamic compromise. Multi-delay ASL is not completely insensitive to delayed arterial transit, and technical improvements are needed to mitigate this.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40965737/",
          "source": "PubMed",
          "relevance_score": 3.0,
          "matched_keywords": [
            "PET",
            "MRI"
          ],
          "journal": "Insights into imaging",
          "volume": "16",
          "issue": "1",
          "pmid": "40965737",
          "doi": "10.1186/s13244-025-02077-4",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Technical Feasibility of Quantitative Susceptibility Mapping Radiomics for Predicting Deep Brain Stimulation Outcomes in Parkinson Disease.",
          "authors": "Alexandra G Roberts, Jinwei Zhang, Ceren Tozlu...",
          "abstract": "Parkinson disease (PD) patients with motor complications are often considered for deep brain stimulation (DBS) surgery. Predicting symptom improvement to separate DBS responders and nonresponders remains an unmet need. Currently, DBS candidacy is evaluated using the levodopa challenge test (LCT) to confirm dopamine responsiveness and diagnosis. However, prediction of DBS success by measuring presurgical symptom improvement associated with levodopa dosage changes is highly problematic. Quantitative susceptibility mapping (QSM) is a recently developed MRI method that depicts brain iron distribution. As the substantia nigra and subthalamic nuclei are well visualized, QSM has been used in presurgical planning of DBS. Spatial features resulting from iron distribution in these nuclei have been previously linked with disease progression and motor symptom severity. Given its clear target depiction and prior findings regarding susceptibility and PD, this study demonstrates the technical feasibility of predicting DBS outcomes from presurgical QSM.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40965145/",
          "source": "PubMed",
          "relevance_score": 2.7,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "Neurosurgery",
          "volume": "",
          "issue": "",
          "pmid": "40965145",
          "doi": "10.1227/neu.0000000000003721",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "MDFNet: a multi-dimensional feature fusion model based on structural magnetic resonance imaging representations for brain age estimation.",
          "authors": "Chenxiao Zhang, Pengzhi Nan, Limei Song...",
          "abstract": "Brain age estimation plays a significant role in understanding the aging process and its relationship with neurodegenerative diseases. The aim of the study is to devise a unified multi-dimensional feature fusion model (MDFNet) to enhance the brain age estimation solely on structural MRI but with a diverse representation of whole brain, tissue segmentation of gray matter volume, node message passing of brain network, edge-based graph path convolution of brain connectivity, and demographic data.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40965801/",
          "source": "PubMed",
          "relevance_score": 2.7,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "Magma (New York, N.Y.)",
          "volume": "",
          "issue": "",
          "pmid": "40965801",
          "doi": "10.1007/s10334-025-01294-8",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Humans have a longer period of cortical maturation across depth and hierarchy than macaques.",
          "authors": "Monami Nishio, Xingyu Liu, Allyson P Mackey...",
          "abstract": "Postnatal brain development in primates involves prolonged structural maturation of the cortex, laying the foundation for advanced perceptual and cognitive functions. In humans, cortical development is thought to progress along a hierarchical gradient from early-maturing sensorimotor regions to later-developing association areas. However, developmental changes across cortical depth, which contribute to both local computation and large-scale network integration, have been largely unexplored. It also remains unclear which features of these maturational trajectories are conserved across primates and how they may have been further extended or modified in humans. Using the T1-weighted/T2-weighted (T1w/T2w) MRI ratio as a noninvasive measure of cortical microarchitecture, we systematically compared depth-dependent and regional developmental trajectories in humans and macaques. We identified a conserved \"inside-out\" gradient of maturation, with deeper cortical depths exhibiting steeper increases in T1w/T2w ratio and earlier plateaus than superficial depths. This depth-dependent pattern was embedded within a broader hierarchical gradient of maturation across the cortical surface, extending from sensorimotor regions to association cortex. While the spatial structure of these gradients was shared across species, humans exhibited markedly prolonged development across the entire cortical hierarchy, including both sensory and association cortices, and across cortical depths. These findings suggest that conserved developmental gradients are elaborated in humans to support an extended window of postnatal plasticity, enabling the experience-dependent refinement of cortical circuits that underlie the complex, integrative functions central to human perception and cognition.",
          "published": "2025-09-01",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40966225/",
          "source": "PubMed",
          "relevance_score": 2.5,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "PLoS biology",
          "volume": "23",
          "issue": "9",
          "pmid": "40966225",
          "doi": "10.1371/journal.pbio.3003378",
          "categories": [
            "PubMed",
            "Animals",
            "Humans",
            "Magnetic Resonance Imaging",
            "Cerebral Cortex",
            "Male"
          ]
        },
        {
          "title": "Evaluation of deuterated [",
          "authors": "Mudasir Maqbool, Daniel Gündel, Jeih-San Liow...",
          "abstract": "PET imaging of cannabinoid type-2 receptors (CB2Rs) in the healthy brain remains challenging due to low receptor density and the unavailability of radiotracers with high affinity and selectivity. Because some carbon-deuterium bonds are less susceptible than carbon-proton bonds to enzymatic cleavage, deuteration of [",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40963389/",
          "source": "PubMed",
          "relevance_score": 2.5,
          "matched_keywords": [
            "PET",
            "brain"
          ],
          "journal": "Journal of cerebral blood flow and metabolism : official journal of the International Society of Cerebral Blood Flow and Metabolism",
          "volume": "",
          "issue": "",
          "pmid": "40963389",
          "doi": "10.1177/0271678X251371377",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Integrating artificial intelligence with Gamma Knife radiosurgery in treating meningiomas and schwannomas: a review.",
          "authors": "Tasneem N Alhosanie, Bassam Hammo, Ahmad F Klaib...",
          "abstract": "Meningiomas and schwannomas are benign tumors that affect the central nervous system, comprising up to one-third of intracranial neoplasms. Gamma Knife radiosurgery (GKRS), or stereotactic radiosurgery (SRS), is a form of radiation therapy. Although referred to as \"surgery,\" GKRS does not involve incisions. The GK medical device effectively utilizes highly focused gamma rays to treat lesions or tumors, primarily in the brain. In radiation oncology, machine learning (ML) has been used in various aspects, including outcome prediction, quality control, treatment planning, and image segmentation. This review will showcase the advantages of integrating artificial intelligence with Gamma Knife technology in treating schwannomas and meningiomas.This review adheres to PRISMA guidelines. We searched the PubMed, Scopus, and IEEE databases to identify studies published between 2021 and March 2025 that met our inclusion and exclusion criteria. The focus was on AI algorithms applied to patients with vestibular schwannoma and meningioma treated with GKRS. Two reviewers participated in the data extraction and quality assessment process.A total of nine studies were reviewed in this analysis. One distinguished deep learning (DL) model is a dual-pathway convolutional neural network (CNN) that integrates T1-weighted (T1W) and T2-weighted (T2W) MRI scans. This model was tested on 861 patients who underwent GKRS, achieving a Dice Similarity Coefficient (DSC) of 0.90. ML-based radiomics models have also demonstrated that certain radiomic features can predict the response of vestibular schwannomas and meningiomas to radiosurgery. Among these, the neural network model exhibited the best performance. AI models were also employed to predict complications following GKRS, such as peritumoral edema. A Random Survival Forest (RSF) model was developed using clinical, semantic, and radiomics variables, achieving a C-index score of 0.861 and 0.780. This model enables the classification of patients into high-risk and low-risk categories for developing post-GKRS edema.AI and ML models show great potential in tumor segmentation, volumetric assessment, and predicting treatment outcomes for vestibular schwannomas and meningiomas treated with GKRS. However, their successful clinical implementation relies on overcoming challenges related to external validation, standardization, and computational demands. Future research should focus on large-scale, multi-institutional validation studies, integrating multimodal data, and developing cost-effective strategies for deploying AI technologies.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40965768/",
          "source": "PubMed",
          "relevance_score": 2.5,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "Neurosurgical review",
          "volume": "48",
          "issue": "1",
          "pmid": "40965768",
          "doi": "10.1007/s10143-025-03820-7",
          "categories": [
            "PubMed",
            "Humans",
            "Radiosurgery",
            "Meningioma",
            "Artificial Intelligence",
            "Meningeal Neoplasms"
          ]
        },
        {
          "title": "Alzheimer's Disease and Dementia.",
          "authors": "",
          "abstract": "",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40966018/",
          "source": "PubMed",
          "relevance_score": 2.4,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Restorative neurology and neuroscience",
          "volume": "",
          "issue": "",
          "pmid": "40966018",
          "doi": "10.1177/09226028251367822",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "C4d, a high-affinity LilrB2 ligand, is elevated in Alzheimer's disease and mediates synapse pruning.",
          "authors": "Barbara K Brott, Aram J Raissi, Kristina D Micheva...",
          "abstract": "Synapse pruning sculpts neural circuits throughout life. The human Leukocyte immunoglobulin-like receptor type B2 (LilrB2)/murine Paired immunoglobulin receptor B (PirB) receptors expressed in neurons and complement protein C4 have been separately implicated in pruning. Here, we report that C4d, a C4 cleavage product with unknown function, binds LilrB2/PirB with nanomolar affinity. C4d and LilrB2 colocalize at excitatory synapses in the human cerebral cortex as well as with beta amyloid in Alzheimer's disease (AD). C4d, as well as C4, increase with age and more so in AD. To examine whether C4d-PirB interactions can drive pruning, dendritic spines-the postsynaptic structure of excitatory synapses-were monitored on L5 pyramidal neurons in the mouse cerebral cortex: A significant decrease in dendritic spine density occurred in WT with C4d exposure, but KO of PirB completely prevented this loss. Together, our findings reveal an unexpected physiological role for C4d in pruning and imply that different complement cascade components may collaborate to engage both neuronal and glial-specific effectors of synaptic pruning.",
          "published": "2025-09-23",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40966293/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid"
          ],
          "journal": "Proceedings of the National Academy of Sciences of the United States of America",
          "volume": "122",
          "issue": "38",
          "pmid": "40966293",
          "doi": "10.1073/pnas.2519253122",
          "categories": [
            "PubMed",
            "Alzheimer Disease",
            "Animals",
            "Humans",
            "Receptors, Immunologic",
            "Synapses"
          ]
        },
        {
          "title": "Frontal Assessment Battery: Reliability, validity and discriminative ability in a Spanish sample of amnestic mild cognitive impairment and Alzheimer's disease.",
          "authors": "Luis Heredia, María Marco, Nerea Carrión...",
          "abstract": "Dementia constitutes one of the most widespread neurological disorders, representing an important health concern due to its increasing prevalence. Among the various types of dementia, Alzheimer's disease (AD) is the most common in the elderly, characterized by episodic memory impairment and also a decline in executive functions. Mild cognitive impairment (MCI) is considered a transitional stage between normal ageing and dementia, often described as a pre-dementia state. Distinguishing between these states is of paramount importance for the detection and appropriate care of patients. Functional Assessment Battery (FAB) is a screening tool for assessing executive function. In this study, 36 healthy individuals (HC), 31 single-domain amnestic mild cognitive impairment (aMCI) patients, and 29 Alzheimer's disease (AD) patients were assessed using FAB to determine its reliability, validity, and discriminative validity in a Spanish sample. Results indicated a good internal consistency of FAB in the AD sample (α = .71), but not in the aMCI group (α = .49). Significant differences between HC and both aMCI and AD groups were observed in the total scores of FAB. The FAB also showed good accuracy in distinguishing between HC and patients (AUC = 0.85), with an estimated optimal cut-off point of 16.5. However, its ability to distinguish between aMCI and AD individuals was lower (AUC = 0.68). More studies are necessary to corroborate our results using larger samples.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40965437/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Journal of neuropsychology",
          "volume": "",
          "issue": "",
          "pmid": "40965437",
          "doi": "10.1111/jnp.70011",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Lipid carrier-based intranasal delivery of calcium channel blockers for Alzheimer's disease.",
          "authors": "Sunil Jog, Sayali Dighe, Khushali Nathani...",
          "abstract": "Felodipine (FLD) is a L-type calcium channel blocker with pronounced neuroprotection against Alzheimer's disease (AD). Unfortunately, the efficacy of FLD has been impeded by limited solubility, poor bioavailability, and sub-optimal accumulation. Thus, the current study unfolds the potential of nanostructured lipid carriers based on in-situ gel of FLD (FLD-NLCs gel) to ameliorate dementia.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40964960/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Expert opinion on drug delivery",
          "volume": "",
          "issue": "",
          "pmid": "40964960",
          "doi": "10.1080/17425247.2025.2564130",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Mechanism of oxidative stress and neurotoxicity associated with heme and copper-Aβ relevant to Alzheimer's disease.",
          "authors": "Chinmay Dey, Madhuparna Roy, Puja Pal...",
          "abstract": "Alzheimer's disease (AD) is a neurodegenerative disorder with a complex pathophysiology involving oxidative stress, amyloid β (Aβ) aggregation and dysregulation of metal ions, particularly copper and heme. The overproduction of reactive oxygen species (ROS) plays a crucial role in the early stages of AD, leading to lipid peroxidation, protein oxidation, nucleic acid damage and neurotransmitter oxidation. These oxidative processes are further catalysed by the accumulation of Aβ peptides, which increase ROS production, creating a self-perpetuating cycle that accelerates disease progression. This review focuses on the critical role of oxidative stress and neurotoxicity associated with heme and copper in AD pathology. Both the metal and the co-factor bind to Aβ peptides, forming complexes that amplify oxidative stress, leading to enhanced neuronal damage. The involvement of Cu/heme-Aβ complexes in redox cycling results in the production of cytotoxic hydrogen peroxide, which drives the oxidation of neurotransmitters and contributes to synaptic dysfunction. These interactions not only disrupt normal neuronal function but also intensify Aβ plaque formation, a key feature of AD progression. Understanding how heme and copper interact with Aβ, and how these interactions are influenced by important residues such as histidine, arginine and tyrosine is crucial. These amino acids play an essential role in metal coordination and in regulating the reactivity of metal/co-factor-Aβ complexes, which directly impacts neuronal health. Unveiling the interactions between Aβ peptides and Cu/heme as well as the associated oxidative reactions offers a promising direction for future research, potentially leading to strategies that mitigate oxidative stress and reduce cytotoxicity in Alzheimer's disease.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40963483/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid"
          ],
          "journal": "Chemical Society reviews",
          "volume": "",
          "issue": "",
          "pmid": "40963483",
          "doi": "10.1039/d5cs00544b",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Varoglutamstat Inhibits the Dimerization of the Aβ",
          "authors": "Hoang Anh Nguyen, Trung Hai Nguyen, Van V Vu...",
          "abstract": "The self-aggregation of amyloid-beta (Aβ) peptides is strongly associated with Alzheimer's disease. In this study, the influence of the small varoglutamstat compound on the conformations of the FAβ",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40892808/",
          "source": "PubMed",
          "relevance_score": 2.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid"
          ],
          "journal": "The journal of physical chemistry. B",
          "volume": "129",
          "issue": "37",
          "pmid": "40892808",
          "doi": "10.1021/acs.jpcb.5c03306",
          "categories": [
            "PubMed",
            "Amyloid beta-Peptides",
            "Peptide Fragments",
            "Molecular Dynamics Simulation",
            "Water",
            "Protein Multimerization"
          ]
        },
        {
          "title": "The impact of high-sugar diets on central nervous system disorders: mechanisms, pathogenesis, and dietary implication.",
          "authors": "Fang Li, Qinghua Luo, Tinghao Guo...",
          "abstract": "Excessive sugar consumption has paralleled the global rise in obesity, type 2 diabetes mellitus (T2DM), and related metabolic disorders. High-sugar diets directly contribute to weight gain, insulin resistance, and chronic hyperglycemia, which drive cardiovascular complications and systemic inflammation through advanced glycation end products (AGEs) and oxidative stress. Emerging evidence highlights their critical role in the pathogenesis of central nervous system (CNS) disorders, including Alzheimer's disease, Parkinson's disease, and stroke, likely mediated through obesity-associated chronic inflammation, T2DM-driven blood-brain barrier dysfunction, and neuroinflammation.",
          "published": "2025-12-01",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40963410/",
          "source": "PubMed",
          "relevance_score": 2.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "brain"
          ],
          "journal": "Annals of medicine",
          "volume": "57",
          "issue": "1",
          "pmid": "40963410",
          "doi": "10.1080/07853890.2025.2561789",
          "categories": [
            "PubMed",
            "Humans",
            "Central Nervous System Diseases",
            "Insulin Resistance",
            "Oxidative Stress",
            "Diabetes Mellitus, Type 2"
          ]
        },
        {
          "title": "Head-to-head comparisons of PET tracers in oncology: pitfalls and challenges. The lesson from neuroblastoma.",
          "authors": "Francesco Fiz, Arnoldo Piccardo, Giorgio Treglia",
          "abstract": "",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40965584/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "PET"
          ],
          "journal": "European journal of nuclear medicine and molecular imaging",
          "volume": "",
          "issue": "",
          "pmid": "40965584",
          "doi": "10.1007/s00259-025-07551-1",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Metabolically Abnormal Obesity and Carotid Plaque Vulnerability: A Vessel Wall MRI Study Linking Obesity Phenotypes to Atherosclerotic Instability.",
          "authors": "Sai Shao, Yan Sun, Honglu Shi...",
          "abstract": "Carotid plaque vulnerability, driven by metabolic dysfunction and obesity, is a critical determinant of ischemic stroke risk. However, the heterogeneity of obesity phenotypes-defined by metabolic health-remains underexplored in cardiovascular risk stratification. Therefore, this study employs high-resolution magnetic resonance vessel wall imaging to assess differences in high-risk carotid plaque features among obesity subtypes stratified by metabolic dysfunction and body mass index.",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40964717/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Arteriosclerosis, thrombosis, and vascular biology",
          "volume": "",
          "issue": "",
          "pmid": "40964717",
          "doi": "10.1161/ATVBAHA.125.323413",
          "categories": [
            "PubMed"
          ]
        }
      ],
      "paper_count": 20
    }
  }
}