{
  "metadata": {
    "created_at": "2025-09-24T14:26:48.266028",
    "weeks_covered": 1,
    "keywords_used": [
      "Alzheimer's disease",
      "PET",
      "MRI",
      "dementia",
      "amyloid",
      "tau",
      "brain",
      "plasma"
    ],
    "data_sources": {
      "pubmed": true
    },
    "search_mode": "Brief (PubMed: 1000, Others: 500)",
    "days_back": 7,
    "total_papers_found": 1000,
    "filtered_papers": 105,
    "high_relevance_papers": 8,
    "top_papers_selected": 8,
    "papers_per_week": 8,
    "date_range": "2025-09-17 to 2025-09-24",
    "selection_criteria": "Papers with relevance score > 4.0 ONLY (up to 20 papers)",
    "selection_details": "Selected 8 papers with relevance score > 4.0 (fewer than 20 available)"
  },
  "weeks": {
    "top_papers": {
      "week_info": {
        "week_number": 1,
        "start_date": "2025-09-17T00:00:00",
        "end_date": "2025-09-24T00:00:00",
        "week_label": "Top 20 Papers (2025-09-17 to 2025-09-24)"
      },
      "papers": [
        {
          "title": "Staging Alzheimer's disease through amyloid and tau PET.",
          "authors": "Derek R Johnson, Heather J Wiste, Val Lowe...",
          "abstract": "A workgroup assembled by the Alzheimer's Association recently described a conceptual framework for Alzheimer's disease biological staging based on amyloid and tau positron emission tomography (PET) imaging. However, specific tau PET cut points were left to be determined, a step necessary prior to clinical application. We sought to operationalize and evaluate Alzheimer's disease biological staging by identifying meaningful tau PET cut points to define the four biological stages in a well-characterized participant cohort and describe the features of individuals placed into the different biological stages. The primary analysis included 896 participants in the Mayo Clinic Study of Aging or the Mayo Clinic Alzheimer's Disease Research Center longitudinal cohorts. A validation cohort consisted of 328 participants in the Alzheimer's Disease Neuroimaging Initiative. Both cognitively normal and impaired individuals with positive amyloid PET and evaluable tau PET imaging were included. Tau PET cut points were identified with Gaussian Mixture Models to characterize Alzheimer's disease biological stage in study participants with different clinical diagnoses and objective degrees of cognitive impairment as measured by Mini-Mental State Examination. A tau PET cut point in the medial temporal region and two cut points in the temporoparietal region were identified to collectively produce the four Alzheimer's disease biological stages described in the revised criteria. Increasing stage was associated with greater likelihood of mild cognitive impairment and dementia diagnosis and worsening cognitive performance on Mini-Mental State Examination and Clinical Dementia Rating Sum of Boxes, a result that was reproduced in the independent Alzheimer's Disease Neuroimaging Initiative cohort. This study provided empiric validation for the concept of using amyloid PET and tau PET to separate subjects with biomarker-proven Alzheimer's disease into four biological stages with distinct characteristics.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40974012/",
          "source": "PubMed",
          "relevance_score": 11.399999999999999,
          "matched_keywords": [
            "Alzheimer's disease",
            "PET",
            "dementia",
            "amyloid",
            "tau"
          ],
          "journal": "Brain : a journal of neurology",
          "volume": "",
          "issue": ""
        },
        {
          "title": "The presymptomatic and early manifestations of semantic dementia.",
          "authors": "David J Whiteside, Matthew A Rouse, P Simon Jones...",
          "abstract": "People with semantic dementia (SD) or semantic variant primary progressive aphasia typically present with marked atrophy of the anterior temporal lobe, and thereafter progress more slowly than other forms of frontotemporal dementia. This suggests a prolonged prodromal phase with accumulation of neuropathology and minimal symptoms, about which little is known. To study early and presymptomatic SD, we first examine a well-characterised cohort of people with SD recruited from the Cambridge Centre for Frontotemporal Dementia. Five people with early SD had coincidental MRI prior to the onset of symptoms, or were healthy volunteers in research with anterior temporal lobe atrophy as an incidental finding. We model longitudinal imaging changes in left- and right-lateralised SD to predict atrophy at symptom onset. We then assess 61,203 participants with structural brain MRI in the UK Biobank to find individuals with imaging changes in keeping with SD but with no neurodegenerative diagnosis. To identify these individuals in UK Biobank, we design an ensemble-based classifier, differentiating baseline structural MRI in SD from healthy controls and patients with other neurodegenerative diseases, including other causes of frontotemporal lobar degeneration. We train the classifier on a Cambridge-based cohort (SD n=47, other neurodegenerative diseases n=498, healthy controls n=88) and test it on a combined cohort from the Neuroimaging in Frontotemporal Dementia study and the Alzheimer's Disease Neuroimaging Initiative (SD n=42, other neurodegenerative n=449, healthy control n=127). From our case series, we find people with marked atrophy three to five years before recognition of symptom onset in left- or right-predominant SD. We present right-lateralised cases with subtle multimodal semantic impairment, found concurrently with only mild behavioural disturbance. We show that imaging measures can be used to reliably and accurately differentiate clinical SD from other neurodegenerative diseases (recall 0.88, precision 0.95, F1 score 0.91). We find individuals with no neurodegenerative diagnosis in the UK Biobank with striking left-lateralised (prevalence ages 45-85 4.8/100,000) or right-lateralised (5.9/100,000) anterior temporal lobe atrophy, with deficits on cognitive testing suggestive of semantic impairment. These individuals show progressive involvement of other cognitive domains in longitudinal follow-up. Together, our findings suggest that (i) there is a burden of incipient early anterior temporal lobe atrophy in older populations, with comparable prevalence of left- and right-sided cases from this prospective unbiased approach to identification, (ii) substantial atrophy is required for manifest symptoms, particularly in right-lateralised cases, and (iii) semantic deficits across multiple domains can be detected in the early symptomatic phase.",
          "published": "2025-09-23",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40986416/",
          "source": "PubMed",
          "relevance_score": 8.4,
          "matched_keywords": [
            "Alzheimer's disease",
            "MRI",
            "dementia",
            "brain"
          ],
          "journal": "Brain : a journal of neurology",
          "volume": "",
          "issue": ""
        },
        {
          "title": "Integrating MRI Volume and Plasma p-Tau217 for Amyloid Risk Stratification in Early-Stage Alzheimer Disease.",
          "authors": "Sohyun Yim, Seongbeom Park, Kyoungyoon Lim...",
          "abstract": "Identifying β-amyloid (Aβ) positivity is crucial for selecting candidates for Aβ-targeted therapies in early-stage Alzheimer disease (AD). While Aβ PET is accurate, its high cost limits routine use. Plasma p-tau217 testing offers a less invasive option but also incurs additional costs. Structural brain MRI, routinely used in cognitive assessments, can identify features predictive of Aβ positivity without extra expense. We evaluated a 2-stage workflow integrating MRI-based features and plasma p-tau217 to efficiently predict Aβ PET positivity in early-stage AD.",
          "published": "2025-09-23",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40829110/",
          "source": "PubMed",
          "relevance_score": 6.6,
          "matched_keywords": [
            "PET",
            "MRI",
            "amyloid",
            "brain",
            "plasma"
          ],
          "journal": "Neurology",
          "volume": "105",
          "issue": "6"
        },
        {
          "title": "P2RX7 modulates the function of human microglia-like cells and mediates the association of IL18 with Alzheimer's disease traits.",
          "authors": "Kelsey S Heavener, Kirstin A Tamucci, Annie J Lee...",
          "abstract": "The immune system plays a dynamic role in neurodegenerative diseases, and purinergic receptors allow immune cells to recognize neuronal signaling, cell injury, or stress. Purinergic Receptor 7 (P2RX7) can modulate inflammatory cascades, and its expression is upregulated in Alzheimer's disease (AD) brain tissue. P2RX7 expression is enriched in microglia, and elevated levels are found in microglia surrounding amyloid-beta (Aβ) plaques in the brain. Despite evidence linking P2RX7 to AD, the mechanisms by which it shapes microglial responses and contributes to AD remain poorly defined. Here, we utilize a human monocyte-derived microglia-like cell model (MDMi) to interrogate P2RX7 activation and downstream consequences on microglial function. Specifically, we measured IL1β and IL18 production and Aβ1-42 uptake following ATP-induced P2RX7 activation. Our results show that ATP-stimulation of MDMi triggers upregulation of IL1β and IL18 expression, which is blocked with the A740003 P2RX7 antagonist. Elevated extracellular ATP also impaired Aβ1-42 uptake, an effect reversed by P2RX7 inhibition with A740003. In addition, pretreatment of MDMi with IL-1Ra limited ATP-driven IL1β and IL18 gene expression upregulation, indicating that ATP immunomodulation of P2RX7 is IL-1R dependent. Critically, analysis of postmortem human brain revealed that P2RX7 expression significantly mediated the association between IL18, but not IL1β, and multiple AD traits, including amyloid load, tau tangle density, global AD pathology burden, cortical and neocortical Lewy bodies, cognitive decline, and clinical dementia. Consistent with these findings, in our MDMi model, P2RX7 gene expression correlated with IL18 but not IL1β. Together, these findings highlight P2RX7 as a critical integrator of extracellular danger signals and microglial immune function, underscoring its potential as a therapeutic target in neurodegeneration.",
          "published": "2025-09-21",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40987420/",
          "source": "PubMed",
          "relevance_score": 5.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "Neurobiology of disease",
          "volume": "",
          "issue": ""
        },
        {
          "title": "CQ-CNN: A lightweight hybrid classical-quantum convolutional neural network for Alzheimer's disease detection using 3D structural brain MRI.",
          "authors": "Mominul Islam, Mohammad Junayed Hasan, M R C Mahdy",
          "abstract": "The automatic detection of Alzheimer's disease (AD) using 3D volumetric MRI data is a complex, multi-domain challenge that has traditionally been addressed by training classical convolutional neural networks (CNNs). With the rise of quantum computing and its potential to replace classical systems in the future, there is a growing need to: (i) develop automated systems for AD detection that run on quantum computers, (ii) explore the capabilities of current-generation classical-quantum architectures, and (iii) identify their potential limitations and advantages. To reduce the complexity of multi-domain expertise while addressing the emerging demands of quantum-based automated systems, our contribution in this paper is twofold. First, we introduce a simple preprocessing framework that converts 3D MRI volumetric data into 2D slices. Second, we propose CQ-CNN, a parameterized quantum circuit (PQC)-based lightweight hybrid classical-quantum convolutional neural network that leverages the computational capabilities of both classical and quantum systems. Our experiments on the OASIS-2 dataset reveal a significant limitation in current hybrid classical-quantum architectures, as they face difficulties converging when class images are highly similar, such as between moderate dementia and non-dementia classes of AD, which leads to gradient failure and optimization stagnation. However, when convergence is achieved, the quantum model demonstrates a promising quantum advantage by attaining state-of-the-art accuracy with far fewer parameters than classical models. For instance, our [Formula: see text]-3-qubit model achieves 97.5% accuracy using only 13.7K parameters (0.05 MB), which is 5.67% higher than a classical model with the same parameter count. Nevertheless, our results highlight the need for improved quantum optimization methods to support the practical deployment of hybrid classical-quantum models in AD detection and related medical imaging tasks.",
          "published": "2025-01-01",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40982572/",
          "source": "PubMed",
          "relevance_score": 5.1,
          "matched_keywords": [
            "Alzheimer's disease",
            "MRI",
            "dementia",
            "brain"
          ],
          "journal": "PloS one",
          "volume": "20",
          "issue": "9"
        },
        {
          "title": "Targeting Metabolic Dysregulation in Alzheimer's Disease: A Potential Therapeutic Strategy.",
          "authors": "Nivedita Barnwal, Sonal Dubey, Prashant Tiwari",
          "abstract": "Alzheimer's disease (AD), the most common form of dementia, is characterized by progressive cognitive decline and neuropathological hallmarks, including amyloid-beta plaques and tau tangles. Emerging evidence implicates metabolic dysfunction as a critical contributor to the pathogenesis and pro-gression of AD. Impaired glucose metabolism, mitochondrial dysfunction, oxidative stress, and lipid dysregulation are frequently observed in AD brains, suggesting that metabolic dysfunction may exacerbate neurodegeneration and cognitive deficits. This review explores the therapeutic potential of targeting met-abolic pathways to mitigate AD pathology. Key metabolic disruptions, including insulin resistance, re-duced cerebral glucose utilization, and mitochondrial inefficiency, are closely linked to neuronal energy deficits and synaptic dysfunction. Therapeutic approaches, such as insulin sensitizers, ketogenic diets, and mitochondrial-targeted antioxidants, have shown promise in preclinical and early clinical studies. Addi-tionally, strategies to modulate lipid metabolism, such as enhancing cholesterol efflux via APOE or re-ducing neurotoxic ceramides, offer potential avenues for intervention. The review also highlights the roles of neuroinflammation and oxidative stress as mediators of metabolic dysfunction in AD, underscoring the need for multifaceted approaches that target both metabolic and inflammatory pathways. The emerging field of precision medicine offers opportunities to tailor interventions based on individual metabolic pro-files, potentially enhancing treatment efficacy. Despite the growing recognition of metabolic dysfunction in AD, translating these insights into effective therapies remains challenging due to the disease's com-plexity and heterogeneity. Future research must focus on elucidating the interplay between metabolic pathways and AD pathology, identifying reliable biomarkers, and designing targeted interventions. By addressing the metabolic underpinnings of AD, this review underscores the potential of metabolic repro-gramming as a novel and integrative therapeutic strategy to slow or prevent disease progression and im-prove patient outcomes.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40990282/",
          "source": "PubMed",
          "relevance_score": 4.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid",
            "tau"
          ],
          "journal": "Current drug metabolism",
          "volume": "",
          "issue": ""
        },
        {
          "title": "Biomarkers for Alzheimer's disease are upregulated in patients with diabetic retinopathy.",
          "authors": "Manju L Subramanian, Konstantina Sampani, Steven Ness...",
          "abstract": "BackgroundDiabetes has been linked to increased prevalence of dementia, but the link between diabetic retinopathy (DR) and Alzheimer's disease (AD) remains unclear.ObjectiveThis study aimed to evaluate potential associations between DR and AD-related protein biomarkers in plasma and ocular fluid.MethodsA prospective, cross-sectional study collected human blood, vitreous, aqueous, and tear samples and measured amyloid-β (Aβ",
          "published": "2025-09-22",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40982223/",
          "source": "PubMed",
          "relevance_score": 4.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid",
            "plasma"
          ],
          "journal": "Journal of Alzheimer's disease : JAD",
          "volume": "",
          "issue": ""
        },
        {
          "title": "Therapeutic Potential of products derived from Pluchea lanceolata for Alzheimer's Disease Treatment.",
          "authors": "Asad Syed, Abdallah M Elgorban, Ali H Bahkali...",
          "abstract": "AD is a neurodegenerative disorder and is associated with the presence of amyloid-β plaques and neurofibrillary tangles leading to net loss of neurons, which demonstrates an urgent unmet need to develop new human health therapies based on the fundamental mechanisms of oxidative stress and neuroinflammation. This work is a computational assessment of the potential use of neolupenol, a triterpenoid produced in Pluchea lanceolata, as a pharmacologically active compound that exerted its beneficial effect through the modulation of the Keap1-Nrf2 axis, one of the central regulators of the antioxidant response. Using an integrated approach that combined network pharmacology, molecular docking, and molecular dynamics (MD) simulations, we identified neolupenol as a high-affinity Keap1-binding molecule capable of activating the Nrf2-mediated neuroprotective pathway. Virtual screening of 25 phytochemicals from Pluchea lanceolata (retrieved from the PubChem database) with customized filters revealed neolupenol as the top candidate, showing strong binding affinity (- 8.22 kcal/mol; Ki = 1.45 µM) toward the Keap1 Kelch domain (PDB ID: 2FLU). The docked complex demonstrated hydrogen bonds with VAL463 (2.17 Å), THR560, and ILE559, along with hydrophobic interactions involving CYS513, ALA366, and VAL514, which collectively stabilized the ligand at the Neh2-binding interface. Network pharmacology yielded 30 of such common targets of AD-neolupenol (e.g., GSK3B, CASP3, TNF, and BACE1), enriched in pathways such as amyloid processing, tau phosphorylation, oxidative stress response, and lipid metabolism (FDR-adjusted p 70%, providing a basis of dynamic stability. The triterpenoid cavity appeared in neolupenol contributing to pleasant PK, the ability to herald the blood-brain barrier, and suboptimal toxicity. These results position neolupenol as a potent, multi-target neuroprotective agent that disrupts Keap1-Nrf2 interaction, promoting Nrf2 nuclear translocation and antioxidant gene activation. Future work warrants in vivo validation of its efficacy in mitigating AD pathology and clinical translation.",
          "published": "2025-09-23",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40986212/",
          "source": "PubMed",
          "relevance_score": 4.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "Journal of molecular neuroscience : MN",
          "volume": "75",
          "issue": "4"
        }
      ],
      "paper_count": 8
    }
  }
}