{
  "metadata": {
    "created_at": "2025-09-19T15:55:17.803768",
    "weeks_covered": 1,
    "keywords_used": [
      "Alzheimer's disease",
      "PET",
      "MRI",
      "dementia",
      "amyloid",
      "tau",
      "brain",
      "plasma"
    ],
    "data_sources": {
      "pubmed": true
    },
    "search_mode": "Brief (PubMed: 1000, Others: 500)",
    "total_papers": 20,
    "papers_per_week": 20,
    "date_range": "2025-09-19 to 2025-09-19"
  },
  "weeks": {
    "today": {
      "week_info": {
        "week_number": 1,
        "start_date": "2025-09-19T00:00:00",
        "end_date": "2025-09-19T00:00:00",
        "week_label": "Today (2025-09-19)"
      },
      "papers": [
        {
          "title": "Nanotechnology-driven approaches for the early detection and targeted treatment of Alzheimer's disease.",
          "authors": "Dinesh Kumar Sharma",
          "abstract": "A neurodegenerative condition called Alzheimer's disease (AD) is brought on by the buildup of beta-amyloid plaques in the brain. As of right now, AD has no known cure. The only thing the medications on the market can do is slow their development. Nonetheless, nanotechnology has demonstrated its superiority in its application in medicine. It has great promise for AD therapy, mostly in diagnosing the ailment and offering a different treatment method. Penetrating and bypassing the blood-brain barrier (BBB) increases the effectiveness of drug delivery. The most recent advancements in AD diagnosis using nanotechnology based on nanoparticles with optical sensing, electrochemical sensing, and imaging approaches are summarised in this study. When treating AD, nanocarriers help deliver the targeted medication. Since one of the newest and most active treatments for AD is nanomedicines, the main goal of this review is to comprehend the sophisticated application of nanocarriers for targeted drug delivery in AD treatment.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40944899/",
          "source": "PubMed",
          "relevance_score": 3.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid",
            "brain"
          ],
          "journal": "Journal of drug targeting",
          "volume": "",
          "issue": "",
          "pmid": "40944899",
          "doi": "10.1080/1061186X.2025.2561788",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Peripheral blood biomarkers and mild behavioral impairment in mild cognitive impairment: Clinical correlations and mechanistic insights.",
          "authors": "Wen-Yong Qiao, Qing-Mei Guo, Xu-Hao Li",
          "abstract": "In the context of global aging, mild behavioral impairment (MBI) is present in 48.9% of patients with mild cognitive impairment (MCI). MBI, a neurobehavioral syndrome in the elderly, is an independent risk factor for cognitive decline and is closely related to peripheral blood biomarkers associated with Alzheimer's disease, offering new diagnostic and interventional avenues for early MCI. To summarize evidence on peripheral blood biomarkers related to MBI and their underlying mechanisms involving neuroinflammation, tau pathology, and oxidative stress, a systematic review of studies published between 2015 and 2024 was conducted. MBI is closely associated with peripheral blood biomarker changes. Neuroinflammatory markers like glial fibrillary acidic protein and neurofilament light indicate astrocyte activation and neural circuit disruption, with glial fibrillary acidic protein levels correlating with impulse dyscontrol scores. Chitinase-3-like protein 1, a marker of blood-brain barrier integrity, exacerbates neuroinflammation and is linked to depressive symptoms and hippocampal atrophy. Elevated phosphorylated tau proteins in blood correlate with brain tau deposition, increasing the risk of MBI and impairing cognition. Oxidative stress markers damage neurons and disrupt neurotransmission, and concurrent alterations in malondialdehyde and superoxide dismutase levels significantly elevate the risk of MBI. The correlation between MBI and biomarkers offers new diagnostic and interventional directions for early MCI. Future research should standardize MBI assessment, conduct longitudinal studies, explore biomarker-MBI relationships, investigate psychosocial impacts, and develop advanced detection methods.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40933160/",
          "source": "PubMed",
          "relevance_score": 3.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "tau",
            "brain"
          ],
          "journal": "World journal of psychiatry",
          "volume": "15",
          "issue": "9",
          "pmid": "40933160",
          "doi": "10.5498/wjp.v15.i9.108910",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Modeling Midbrain and Brainstem Neuromelanins to Characterize Metal Binding and Associated MRI Contrast in Parkinson's and Alzheimer's Diseases.",
          "authors": "Niklas Wallstein, Andrea Capucciati, Andreas Pöppl...",
          "abstract": "Neuromelanin (NM) is a dark pigment that binds potentially toxic metal ions and is crucial for neuronal vulnerability. Magnetic resonance imaging (MRI) was proposed to measure neuromelanin in the substantia nigra or locus coeruleus, potentially providing a marker of Parkinson's disease. Here, synthetic neuromelanin analogues were prepared with iron and copper and used for characterization of metal binding and impact on proton relaxation, a prerequisite for optimizing neuromelanin-sensitive MRI. The results confirm the presence of paramagnetic mononuclear Fe(III) and antiferromagnetically coupled clusters, which enhance relaxation to variable degrees. Further complexity arises from Cu(II), which can compete for binding to mononuclear sites, aggregate in mixed-metal clusters, or bind to proteins associated with the melanin moiety. Unlike the strong relaxant Fe(III), Cu(II) only indirectly impacts relaxation by replacing iron. Overall, MRI primarily provides measures of average neuromelanin concentrations. Information on the distribution of neuromelanins with different metal compositions might be obtained with multiparametric MRI.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970816/",
          "source": "PubMed",
          "relevance_score": 2.9,
          "matched_keywords": [
            "Alzheimer's disease",
            "MRI"
          ],
          "journal": "Angewandte Chemie (International ed. in English)",
          "volume": "",
          "issue": "",
          "pmid": "40970816",
          "doi": "10.1002/anie.202509102",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Fulminant idiopathic intracranial hypertension mimicking Chiari I malformation in a pediatric patient: diagnostic value of MRI and promising outcomes with venous sinus stenting.",
          "authors": "Manel Krouma, Basile Kerleroux, Beatrice Desnous...",
          "abstract": "Idiopathic intracranial hypertension (IIH) is a rare but potentially serious condition in children, with the risk of permanent vision loss in rapidly progressing or treatment-resistant cases. One diagnostic challenge is that cerebellar tonsillar descent-a feature sometimes seen in IIH-can mimic Chiari I malformation, potentially leading to misdiagnosis and unnecessary, risky surgery. We report the case of a 13-year-old boy with fulminant idiopathic intracranial hypertension (IIH), who presented with rapidly worsening visual symptoms and severe papilledema over the course of a few days. Initial brain MRI excluded other causes of increased intracranial pressure, raising suspicion for IIH. The imaging also revealed cerebellar tonsillar descent, initially suggesting a possible Chiari I malformation. However, additional MRI findings were more consistent with IIH than Chiari I, including an arachnoidocele of the sella, flattening of the posterior sclera, and bilateral transverse sinus stenosis. A cerebral venography confirmed significant venous outflow obstruction, with a high-pressure gradient across the stenotic transverse sinuses. Based on these findings, venous sinus stenting was performed as a first-line treatment. This resulted in rapid symptom improvement, with complete resolution of headache and papilledema on follow-up. MRI plays a critical role in diagnosis-not only in excluding other conditions but also in positively identifying IIH, especially in atypical and fulminant presentations. When medical treatment fails, surgical options include CSF shunting or increasingly, venous sinus stenting, particularly when venous sinus stenosis is present. Though commonly used in adults, this approach is showing promise in pediatric patients as well, despite some specific challenges. Early diagnosis, appropriate imaging, and a multidisciplinary approach are essential to prevent vision loss and ensure the best possible outcomes in these complex pediatric cases.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970992/",
          "source": "PubMed",
          "relevance_score": 2.7,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "Child's nervous system : ChNS : official journal of the International Society for Pediatric Neurosurgery",
          "volume": "41",
          "issue": "1",
          "pmid": "40970992",
          "doi": "10.1007/s00381-025-06907-0",
          "categories": [
            "PubMed",
            "Humans",
            "Male",
            "Adolescent",
            "Arnold-Chiari Malformation",
            "Magnetic Resonance Imaging"
          ]
        },
        {
          "title": "Association between the fresh frozen plasma-to-red blood cell transfusion ratio and neurological outcomes in patients with severe traumatic brain injury.",
          "authors": "Shu Utsumi, Shingo Ohki, Nobuaki Shime",
          "abstract": "To date, no studies have focused on the fresh frozen plasma (FFP)-to-red blood cell (RBC) transfusion ratio in patients with severe traumatic brain injury (TBI). Herein, the authors investigated the relationship between the FFP-to-RBC ratio and neurological outcomes, including mortality, in patients with severe TBI (Glasgow Coma Scale [GCS] score < 9).",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40972016/",
          "source": "PubMed",
          "relevance_score": 2.4,
          "matched_keywords": [
            "brain",
            "plasma"
          ],
          "journal": "Journal of neurosurgery",
          "volume": "",
          "issue": "",
          "pmid": "40972016",
          "doi": "10.3171/2025.5.JNS25939",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Pharmacological strategies for managing dementia with Lewy bodies: an expert review of symptom-targeted care.",
          "authors": "Oluwatosin Atewogboye, John Paul Taylor, Judith R Harrison",
          "abstract": "Dementia with Lewy Bodies (DLB) is the second most common cause of neurodegenerative dementia after Alzheimer's disease, characterized by a complex combination of cognitive, neuropsychiatric, motor, autonomic, and sleep-related symptoms. Symptom fluctuation, polypharmacy risks, and high sensitivity to commonly used drugs present unique challenges for management.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40955908/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Expert review of clinical pharmacology",
          "volume": "",
          "issue": "",
          "pmid": "40955908",
          "doi": "10.1080/17512433.2025.2562151",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Testing the Clinical Dementia Rating Sum of Boxes as an Outcome for Dementia with Lewy Bodies Clinical Trials.",
          "authors": "James E Galvin, Andres Salcedo",
          "abstract": "Dementia with Lewy bodies (DLB), a common cause of dementia, has no FDA-approved therapies, and clinical trials to date have had limited ability to demonstrate efficacy. The lack of validated DLB-specific clinical trial outcomes may hinder these efforts. Here, we test whether the Clinical Dementia Rating (CDR) and other commonly used clinical evaluation tools for Alzheimer's disease (AD) and Parkinson's disease (PD) could potentially be used as outcome measures in future DLB clinical trials.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40971142/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Neurology and therapy",
          "volume": "",
          "issue": "",
          "pmid": "40971142",
          "doi": "10.1007/s40120-025-00822-x",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Tween 80-Modified Chitosan Nanoparticles via Ionotropic Gelation for Enhanced Brain Delivery of Chrysin and Improved Anxiolytic Efficacy in Preclinical Models.",
          "authors": "Payal Dey, Somesh Narayan, Kalpana Nagpal",
          "abstract": "The natural polyphenol \"Chrysin,\" an antianxiety compound, has limited brain uptake due to the restricted crossing of the blood-brain barrier (BBB). In this study, we formulated Chrysin-encapsulated chitosan nanoparticles (CNPs) and Tween 80-coated CNPs (cCNPs) to improve Chrysin's uptake in the brain and enhance the antianxiety effects. The CNP and cCNP nanoformulations were physicochemically characterized for calculating their particle size, polydispersity index (PDI), drug entrapment efficiency (EE %), and zeta potential. Further, transmission electron microscopy (TEM), Fourier transform infrared spectroscopy (FTIR), and in vitro release studies were performed. The obtained results indicated the reduced particle size of cCNP NPs (174.40 ± 2.51 nm) compared to CNPs (197.67 ± 4.94 nm) and showed an increased EE for cCNPs (86.8%) compared to CNPs (82.73%). The zeta potential of cCNPs was calculated to be -14.4 ± 1.20 mV, in contrast to +12.3 ± 0.50 mV for CNPs. TEM images exhibited the presence of spherical cCNPs. In vivo studies revealed a higher time in the light compartment in the light-dark model and increased time spent in the open arm in elevated and maze models. This demonstrates significantly enhanced antianxiety effects of cCNPs compared to CNPs and pure Chrysin. These findings were further validated by the significant reduction in plasma nitrite levels, without any impact on locomotor activity. Additionally, histopathological evaluation of liver, kidney, and brain tissues confirmed the safety of cCNPs, with no significant structural changes observed. This study augments the therapeutic efficacy of cCNPs through enhanced brain uptake by reduced particle size and facilitating adsorptive transcytosis.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970909/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "brain",
            "plasma"
          ],
          "journal": "Molecular pharmaceutics",
          "volume": "",
          "issue": "",
          "pmid": "40970909",
          "doi": "10.1021/acs.molpharmaceut.5c00611",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "The role of vitamins in dementia prevention and cognitive health: A comprehensive review.",
          "authors": "Adeel Ahmed, Hamid Khan, Syed Shahab Ud Din Shah...",
          "abstract": "Dementia is a progressive neurodegenerative disorder characterized by cognitive decline that interferes with daily functioning, particularly in the elderly. As one of the leading causes of disability among older adults, dementia remains a significant public health concern. Emerging evidence suggests that certain vitamins may play a crucial role in the prevention and management of cognitive impairment. This review explores the potential impact of key micronutrients specifically water-soluble vitamins such as vitamin C and B-complex (B1, B2, B3, B5, B6, B9, B12), and fat-soluble vitamins A, D, E, and K on dementia pathogenesis and cognitive function. Vitamin B deficiencies have been associated with brain atrophy, an early indicator of cognitive decline, and supplementation has shown promise in enhancing memory and slowing brain shrinkage. Similarly, vitamin C exhibits antioxidative properties that may protect against neurodegeneration. While nutritional support, particularly through micronutrient intake, is increasingly considered a viable strategy for cognitive preservation, findings from epidemiological and clinical studies remain mixed. These inconsistencies highlight the need for further research to determine optimal dosing, efficacy, and long-term impact of vitamin supplementation in dementia prevention. A well-balanced diet rich in essential vitamins may support brain health, but individual variability suggests the importance of personalized nutritional interventions. This review underscores the potential role of vitamins in maintaining cognitive health and calls for continued investigation into their therapeutic utility in delaying or preventing dementia.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40971320/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "dementia",
            "brain"
          ],
          "journal": "Journal of Alzheimer's disease : JAD",
          "volume": "",
          "issue": "",
          "pmid": "40971320",
          "doi": "10.1177/13872877251379700",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Machine learning-based risk scores are associated with conversion to dementia in Veterans.",
          "authors": "Karl Brown, Andrew Shutes-David, Katie Wilson...",
          "abstract": "BackgroundWe previously developed ancestry-specific risk scores for undiagnosed Alzheimer's disease and related dementias (ADRD) in Black and White American (BA and WA) Veterans by applying natural language processing and machine learning (ML) to Veterans Health Administration electronic health records. Using blinded manual chart reviews, we identified an association between ADRD risk scores and probable ADRD diagnosis at the time the scores were generated. However, it was unclear whether these scores were associated with future ADRD diagnoses and mortality.ObjectiveTo evaluate whether ADRD risk scores are associated with subsequent ADRD incidence and all-cause mortality among BA and WA Veterans without a prior ADRD diagnosis.MethodsWe conducted survival analyses to assess the association between baseline ADRD risk scores and time to either ADRD diagnosis or death. Cause-specific Cox proportional hazards models, treating death as a competing risk, were used to estimate hazard ratios (HRs) and 95% confidence intervals (CIs). Analyses were stratified by race and conducted separately for BA and WA Veterans.ResultsHigher ADRD risk scores were significantly associated with increased risk of developing an ADRD diagnosis (HR = 1.98, 95% CI: 1.72-2.27 for BAs; HR = 2.13, 95% CI: 1.79-2.54 for WAs) and mortality (HR = 1.52, 95% CI: 1.40-1.65 for BAs; HR = 1.55, 95% CI: 1.42-1.69 for WAs).ConclusionsIn addition to identifying undiagnosed cases, ML-derived ADRD risk scores are associated with increased risks of developing future ADRD and mortality, which supports their potential utility for both early detection and prognosis.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40971323/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Journal of Alzheimer's disease : JAD",
          "volume": "",
          "issue": "",
          "pmid": "40971323",
          "doi": "10.1177/13872877251378773",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Exosomes as Emerging Therapeutic Platforms in Neurological and Psychiatric Disorders.",
          "authors": "Ram Mohan Ram Kumar, Logesh Rajan, Saravana Babu Chidambaram",
          "abstract": "Exosomes, small extracellular vesicles (sEVs) that range in Size from 30 to 150 nm in diameter, have emerged as crucial mediators of intercellular communication within the central nervous system (CNS). They play significant roles in the pathogenesis and progression of various neurological and psychiatric disorders, including Alzheimer's disease, Parkinson's disease, ischemic stroke, depression, bipolar disorder, and autism spectrum disorder. Exosomes carry a diverse cargo of proteins, nucleic acids, lipids, and other bioactive molecules that can influence neuronal function and synaptic plasticity. In disease states, exosomes derived from stressed neurons or glial cells can propagate neuroinflammation, synaptic dysfunction, and cognitive decline. They may also mediate the spread of abnormal proteins or microRNAs, disrupting neuronal connectivity and neurotransmitter signaling and contributing to the development of proteinopathies and neurotoxicity. Owing to their presence in bodily fluids such as blood plasma, cerebrospinal fluid, and saliva, exosomes hold promise as biomarkers for these disorders. Moreover, their regulatory roles present new opportunities for developing novel diagnostic biomarkers and therapeutic interventions. This review provides an overview of the multifaceted roles of exosomes in neurological and psychiatric disorders. We delve into their contributions to disease pathogenesis, their potential as diagnostic biomarkers, and the innovative therapeutic strategies leveraging exosome-based delivery systems. By exploring the current state of research, we aim to highlight the translational potential of exosomes in revolutionizing the diagnosis and treatment of these disorders.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40971120/",
          "source": "PubMed",
          "relevance_score": 2.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "plasma"
          ],
          "journal": "Pharmaceutical medicine",
          "volume": "",
          "issue": "",
          "pmid": "40971120",
          "doi": "10.1007/s40290-025-00584-9",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "A High-Sensitivity Genetically Encoded Biosensor for Terephthalic Acid Detection in PET Degradation.",
          "authors": "Seok Jin Oh, Jung-Ung An, Jun-Hong Park...",
          "abstract": "The accumulation of polyethylene terephthalate (PET) waste poses a serious environmental challenge due to its durability and resistance to degradation. Enzymatic PET hydrolysis offers a sustainable solution, but efficient high-throughput screening tools for PET-degrading enzymes remain limited. Here, we report a genetically encoded biosensor (GEB) for terephthalic acid (TPA)─the primary monomer released during PET degradation─that enables rapid and sensitive detection of enzymatic activity. We engineered a TphR-based biosensor in",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40814178/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "PET"
          ],
          "journal": "ACS synthetic biology",
          "volume": "14",
          "issue": "9",
          "pmid": "40814178",
          "doi": "10.1021/acssynbio.5c00279",
          "categories": [
            "PubMed",
            "Biosensing Techniques",
            "Polyethylene Terephthalates",
            "Phthalic Acids",
            "Escherichia coli",
            "Biodegradation, Environmental"
          ]
        },
        {
          "title": "Letter re: CT vs MRI C-Spine Imaging for C-Spine Clearance in Obtunded Patients in Low-Energy Trauma Mechanisms.",
          "authors": "Henry Krasner, Robert Rakosi, Allison G McNickle",
          "abstract": "",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970328/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "The American surgeon",
          "volume": "",
          "issue": "",
          "pmid": "40970328",
          "doi": "10.1177/00031348251367032",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Correction to: Prediction of double expression status of primary CNS lymphoma using multiparametric MRI radiomics combined with habitat radiomics: a double-center study.",
          "authors": "Jianxin Zhao, Lijun Liang, Jixian Li...",
          "abstract": "",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40971003/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Journal of neuro-oncology",
          "volume": "",
          "issue": "",
          "pmid": "40971003",
          "doi": "10.1007/s11060-025-05234-3",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Role of resolve DWI and DCE MRI in differentiating benign and malignant skull base lesions.",
          "authors": "Pradeep Mohanasundaram, Jyoti Kumar, Gaurav Shanker Pradhan...",
          "abstract": "To assess the utility of RESOLVE Diffusion-Weighted Imaging (DWI) and Dynamic Contrast-Enhanced (DCE) MRI in differentiating benign and malignant skull base lesions using qualitative and quantitative imaging parameters.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970957/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Neuroradiology",
          "volume": "",
          "issue": "",
          "pmid": "40970957",
          "doi": "10.1007/s00234-025-03760-5",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Deep learning-based acceleration and denoising of 0.55T MRI for enhanced conspicuity of vestibular Schwannoma post contrast administration.",
          "authors": "Maximilian Hinsen, Armin Nagel, Rafael Heiss...",
          "abstract": "Deep-learning (DL) based MRI denoising techniques promise improved image quality and shorter examination times. This advancement is particularly beneficial for 0.55T MRI, where the inherently lower signal-to-noise (SNR) ratio can compromise image quality. Sufficient SNR is crucial for the reliable detection of vestibular schwannoma (VS). The objective of this study is to evaluate the VS conspicuity and acquisition time (TA) of 0.55T MRI examinations with contrast agents using a DL-denoising algorithm.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970959/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Neuroradiology",
          "volume": "",
          "issue": "",
          "pmid": "40970959",
          "doi": "10.1007/s00234-025-03758-z",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "An assessment of conformance to structured reporting framework in 68Ga prostate-specific membrane antigen PET/computed tomography for prostate cancer staging.",
          "authors": "Jagrati Chaudhary, Sanjay Kumar, Param Dev Sharma...",
          "abstract": "68Ga prostate-specific membrane antigen (PSMA) PET/computed tomography (CT) plays a critical role in prostate cancer management. Most clinical reports, however, remain unstructured, increasing the risk of omitting essential diagnostic information. Although standardized frameworks such as PROMISE (Prostate Cancer Molecular Imaging Standardized Evaluation) have been proposed to improve consistency, real-world adherence remains variable. This study assessed the adequacy of 68Ga PSMA PET/CT reports and evaluated their alignment with PROMISE recommendations.",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970435/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "PET"
          ],
          "journal": "Nuclear medicine communications",
          "volume": "",
          "issue": "",
          "pmid": "40970435",
          "doi": "10.1097/MNM.0000000000002048",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Correction: Preoperative MRI abnormalities are not associated with poor outcomes or altered surgical planning in unicompartmental knee arthroplasty: a systematic review and meta-analysis.",
          "authors": "Ali Salmani, Yashar Khani, Mohammadkazem Shojaei...",
          "abstract": "",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40971036/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "European journal of orthopaedic surgery & traumatology : orthopedie traumatologie",
          "volume": "35",
          "issue": "1",
          "pmid": "40971036",
          "doi": "10.1007/s00590-025-04522-y",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Relationship Between Quantitative MRI UTE T2* of ACL Autografts and BMI-Normalized Knee Laxity within the First Year After ACL Reconstruction.",
          "authors": "Alonso Figueroa, Tomasz Bugajski, Dillon Humpal...",
          "abstract": "The anterior cruciate ligament reconstruction (ACLR) graft undergoes a remodeling process that affects its structural properties. Ultrashort echo time T",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40970673/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "The American journal of sports medicine",
          "volume": "",
          "issue": "",
          "pmid": "40970673",
          "doi": "10.1177/03635465251368393",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "[18F]FDG PET/CT of FUO/IUO in special populations.",
          "authors": "Domenico Albano, Carlo Rodella, Andrea Guarneri...",
          "abstract": "",
          "published": "2025-09-19",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40968677/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "PET"
          ],
          "journal": "The quarterly journal of nuclear medicine and molecular imaging : official publication of the Italian Association of Nuclear Medicine (AIMN) [and] the International Association of Radiopharmacology (IAR), [and] Section of the Society of...",
          "volume": "",
          "issue": "",
          "pmid": "40968677",
          "doi": "10.23736/S1824-4785.25.03649-0",
          "categories": [
            "PubMed"
          ]
        }
      ],
      "paper_count": 20
    }
  }
}