{
  "metadata": {
    "created_at": "2025-09-15T21:02:56.926623",
    "weeks_covered": 1,
    "keywords_used": [
      "Alzheimer's disease",
      "PET",
      "MRI",
      "dementia",
      "amyloid",
      "tau",
      "brain",
      "plasma"
    ],
    "data_sources": {
      "pubmed": true
    },
    "search_mode": "Brief (PubMed: 1000, Others: 500)",
    "total_papers": 20,
    "papers_per_week": 20,
    "date_range": "2025-09-15 to 2025-09-15"
  },
  "weeks": {
    "today": {
      "week_info": {
        "week_number": 1,
        "start_date": "2025-09-15T00:00:00",
        "end_date": "2025-09-15T00:00:00",
        "week_label": "Today (2025-09-15)"
      },
      "papers": [
        {
          "title": "Plasma Phosphorylated Tau 217 to Identify Preclinical Alzheimer Disease.",
          "authors": "Gemma Salvadó, Shorena Janelidze, Divya Bali...",
          "abstract": "Advances in Alzheimer disease (AD) have shifted research focus to earlier disease stages, necessitating more scalable approaches to identify cognitively unimpaired individuals with amyloid β (Aβ) pathology.",
          "published": "2025-09-15",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40952756/",
          "source": "PubMed",
          "relevance_score": 6.199999999999999,
          "matched_keywords": [
            "amyloid",
            "tau",
            "plasma"
          ],
          "journal": "JAMA neurology",
          "volume": "",
          "issue": "",
          "pmid": "40952756",
          "doi": "10.1001/jamaneurol.2025.3217",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Analytical considerations and clinical utility of plasma phosphorylated Tau217.",
          "authors": "Hans Frykman",
          "abstract": "Blood-based biomarkers are an easily available and practical tool for Alzheimer's disease (AD) screening and diagnosis. Plasma phosphorylated Tau217 (p-tau217) is the front-runner candidate for AD diagnosis due to its strong correlation with core AD pathology determined either by cerebrospinal fluid biomarker (CSF) and positron emission tomography (PET) or postmortem examination. While plasma p-tau217 is firmly associated with AD pathology, it is crucial to evaluate its performance in distinguishing AD from mixed pathologies, as brain autopsies have shown the coexisting of AD pathology with other related types of dementia. Moreover, the measurement of AD biomarkers will be a crucial element in defining eligibility for disease-modifying treatment in clinical practice. Moreover, plasma p-tau217 is a highly efficacious biomarker in the early detection of Aβ pathology, making it a feasible test for AD screening in clinical practice. Several assays, including the ALZpath p-tau217 assay and the Fujirebio plasma p-tau217 assay, have been made commercially available for research use. A few studies analytically and clinically have validated these immunoassays as laboratory diagnostic tests for AD diagnosis and differentiating from non-AD neurodegenerative disorders in clinical practice.",
          "published": "2025-09-15",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40952136/",
          "source": "PubMed",
          "relevance_score": 5.7,
          "matched_keywords": [
            "Alzheimer's disease",
            "PET",
            "dementia",
            "brain",
            "plasma"
          ],
          "journal": "Critical reviews in clinical laboratory sciences",
          "volume": "",
          "issue": "",
          "pmid": "40952136",
          "doi": "10.1080/10408363.2025.2551648",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Therapeutic and clinical potential of thiolutin microneedles on Alzheimer's disease mitigation.",
          "authors": "Ghulam Jilany Khan, Aqsa Maimoona Malik",
          "abstract": "The long-term malfunctioning of brain in older people neurons is known as Alzheimer's disease (Alz-D), the most prevalent form of dementia worldwide. Pathophysiology of Alz-D includes, amyloid plaque, cholinergic neuron loss, choline acetyltransferase reduction, and tau fibrillary tangle progression. Several theories were also developed mainly involving the cerebral cortex and hippocampus, but unfortunately, there is currently no medication that protects or regenerates neurons. Symptoms may include impairment in memory, speech, personality, verbal fluency, and progressive mental failure. Symptoms are managed with a variety of FDA-approved medications; however, researchers are still searching for new molecular targets to treat Alz-D in addition to working on drug development. Clinical trials for the treatment of Alz-D are among the various strategies being tried in the current scenario. Thus, the main purpose of this study was to provide an overview of the key developments in Alz-D, and novel pharmacological therapies. Extensive review of various database, journals, books and websites are explored to select and analyse data based on pathophysiology, aetiology and different medications either approved or undergoing clinical trials, along with special emphasis on novel therapeutic approach; 'thiolutin' safety, efficacy, therapeutic outcomes, mode of action, structure activity relationship and molecular targets. We also emphasized on preparation of microneedle formulation of thiolutin to address its toxicity and to improve its efficacy. By utilizing microneedles nanomedicines and numerous novel approaches, currents study also aims to elucidate recent advancements and treatment options in future medicines.",
          "published": "2025-09-15",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40582522/",
          "source": "PubMed",
          "relevance_score": 5.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "International journal of pharmaceutics",
          "volume": "682",
          "issue": "",
          "pmid": "40582522",
          "doi": "10.1016/j.ijpharm.2025.125898",
          "categories": [
            "PubMed",
            "Alzheimer Disease",
            "Humans",
            "Animals",
            "Needles",
            "Drug Delivery Systems"
          ]
        },
        {
          "title": "Predictors of MRI-estimated brain iron deposition in dementia and Parkinson's disease-associated subcortical regions: Genetic and observational analysis in UK Biobank.",
          "authors": "Francesco Casanova, Qu Tian, Daniel S Williamson...",
          "abstract": "BackgroundBrain iron in specific subcortical regions increases risk of dementia and Parkinson's disease (PD). Genetic and environmental factors affect iron deposition, but underlying mechanisms are unclear.ObjectiveIdentify risk factors and diseases associated with brain iron; assess causality using genetics.Methods41,581 UK Biobank participants had MRI-estimated brain iron (QSM method) in five dementia or PD-associated subcortical regions (caudate, hippocampus, putamen, substantia nigra, thalamus). We investigated common risk factors (including adiposity, blood pressure, health behaviors, inflammation) and diseases observationally, using covariate-adjusted regression models, and genetically, with Mendelian randomization.ResultsParticipants diagnosed with Alzheimer's disease, PD, or other diseases had higher MRI-estimated brain iron. Anemia, osteoporosis, and hyperparathyroidism were associated with lower brain iron. Higher body mass index and blood pressure, smoking history, and self-reported meat consumption, increased brain iron. Hematological parameters, inflammatory and kidney biomarkers, and calcium, were also associated. Genetics support causal effects of depression, type-2 diabetes, and 7 other diseases with increased iron, but not Alzheimer's disease. Evidence supports a causal effect of osteoporosis on lower iron in the substantia nigra. We found causal associations between adiposity and proteins (including IL-6 receptor and transferrin receptor) on subcortical brain iron.ConclusionsWe identified causal effects for liability to type-2 diabetes, depression, and other conditions, on subcortical MRI-estimated brain iron, but not to Alzheimer's disease, supportive of dementia as a consequence of brain iron deposition, not a cause. The role of adiposity reducing interventions on brain iron should be investigated. Relationships between brain iron, osteoporosis, calcium, and hyperparathyroidism warrant further investigation.",
          "published": "2025-09-15",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40953027/",
          "source": "PubMed",
          "relevance_score": 5.1,
          "matched_keywords": [
            "Alzheimer's disease",
            "MRI",
            "dementia",
            "brain"
          ],
          "journal": "Journal of Alzheimer's disease : JAD",
          "volume": "",
          "issue": "",
          "pmid": "40953027",
          "doi": "10.1177/13872877251375432",
          "categories": [
            "PubMed"
          ]
        }
        
      ],
      "paper_count": 20
    }
  }
}