{
  "metadata": {
    "created_at": "2025-09-18T21:37:32.688267",
    "weeks_covered": 1,
    "keywords_used": [
      "Alzheimer's disease",
      "PET",
      "MRI",
      "dementia",
      "amyloid",
      "tau",
      "brain",
      "plasma"
    ],
    "data_sources": {
      "pubmed": true
    },
    "search_mode": "Brief (PubMed: 1000, Others: 500)",
    "total_papers": 20,
    "papers_per_week": 20,
    "date_range": "2025-09-18 to 2025-09-18"
  },
  "weeks": {
    "today": {
      "week_info": {
        "week_number": 1,
        "start_date": "2025-09-18T00:00:00",
        "end_date": "2025-09-18T00:00:00",
        "week_label": "Today (2025-09-18)"
      },
      "papers": [
        {
          "title": "Design of Tau Aggregation Inhibitors Using Iterative Machine Learning and a Polymorph-Specific Brain-Seeded Fibril Amplification Assay.",
          "authors": "Alessia Santambrogio, Robert I Horne, Michael A Metrick...",
          "abstract": "The aggregation of tau into amyloid fibrils is associated with Alzheimer's disease (AD) and related tauopathies. Since different tauopathies are characterized by the formation of distinct tau fibril morphologies, it is important to combine the search of tau aggregation inhibitors with the development of in vitro tau aggregation assays that recapitulate aggregation as it may occur in the brain. Here we address this problem by reporting an in vitro tau aggregation assay in which AD brain homogenates are used to seed the generation of first-generation tau fibrils in a polymorph-specific manner under quiescent conditions. These fibrils are then used to create amyloid seed libraries from which second-generation kinetic assays can be readily performed. Using this strategy, we illustrate an iterative machine learning method for the identification of small molecules for the polymorph-specific inhibition of the in vitro formation of tau fibrils. We further show that the small molecules selected by this procedure are potent inhibitors in a",
          "published": "2025-09-18",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40964862/",
          "source": "PubMed",
          "relevance_score": 4.4,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "Journal of the American Chemical Society",
          "volume": "",
          "issue": "",
          "pmid": "40964862",
          "doi": "10.1021/jacs.5c12812",
          "categories": [
            "PubMed"
          ]
        }
      ],
      "paper_count": 20
    }
  }
}