{
  "metadata": {
    "created_at": "2025-09-16T22:04:38.810753",
    "weeks_covered": 1,
    "keywords_used": [
      "Alzheimer's disease",
      "PET",
      "MRI",
      "dementia",
      "amyloid",
      "tau",
      "brain",
      "plasma"
    ],
    "data_sources": {
      "pubmed": true
    },
    "search_mode": "Brief (PubMed: 1000, Others: 500)",
    "total_papers": 20,
    "papers_per_week": 20,
    "date_range": "2025-09-16 to 2025-09-16"
  },
  "weeks": {
    "today": {
      "week_info": {
        "week_number": 1,
        "start_date": "2025-09-16T00:00:00",
        "end_date": "2025-09-16T00:00:00",
        "week_label": "Today (2025-09-16)"
      },
      "papers": [
        {
          "title": "Dysregulated Lipids in Alzheimer's Disease: Insights into Biological Pathways through LC-MS/MS Analysis of Human Brain Tissues.",
          "authors": "Akeem Sanni, Andrew I Bennett, Moyinoluwa Adeniyi...",
          "abstract": "Alzheimer's Disease (AD), the leading cause of dementia, is characterized by complex pathological mechanisms that extend beyond amyloid-β plaques and tau tangles. This study investigates the dysregulation of lipids with a focus on phospholipids and sphingolipids, in human post-mortem AD brain tissue using lipidomics methodology. By employing a ZIC-HILIC LC-MS/MS platform, the lipidome of AD (",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40957103/",
          "source": "PubMed",
          "relevance_score": 5.4,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "ACS chemical neuroscience",
          "volume": "",
          "issue": "",
          "pmid": "40957103",
          "doi": "10.1021/acschemneuro.5c00230",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Differential Effects on",
          "authors": "Veena Prasad, Truman C Gamblin",
          "abstract": "Neurofibrillary tangles are intracellular aggregates composed of the microtubule-associated protein tau. These insoluble aggregates are found in the brain of those affected by Alzheimer's disease and other related tauopathies. Hyperphosphorylation of tau in disease has been hypothesized to cause tau to dissociate from microtubules and form amyloid-like oligomers and fibrils. Under normal conditions, there is 2-3 mol of phosphate per mole of tau; however, studies have found 2-3 times more phosphate per mole of tau in diseased conditions. The",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40884466/",
          "source": "PubMed",
          "relevance_score": 4.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid",
            "tau",
            "brain"
          ],
          "journal": "Biochemistry",
          "volume": "64",
          "issue": "18",
          "pmid": "40884466",
          "doi": "10.1021/acs.biochem.5c00358",
          "categories": [
            "PubMed",
            "tau Proteins",
            "Humans",
            "Phosphorylation",
            "Protein Aggregates",
            "Arachidonic Acid"
          ]
        },
        {
          "title": "Prediction of cerebrospinal fluid intervention in fetal ventriculomegaly via AI-powered normative modelling.",
          "authors": "Minerva Zhou, Siddharthasiva A Rajan, Pierre Nedelec...",
          "abstract": "Fetal ventriculomegaly (VM) is common and largely benign when isolated. However, it can occasionally progress to hydrocephalus, a more severe condition associated with increased mortality and neurodevelopmental delay that may require surgical postnatal intervention. Accurate differentiation between VM and hydrocephalus is essential but remains challenging, relying on subjective assessment and limited two-dimensional measurements. Deep learning-based segmentation offers a promising solution for objective and reproducible volumetric analysis. This work presents an AI-powered method for segmentation, volume quantification, and classification of the ventricles in fetal brain MRI to predict need for postnatal intervention.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40957691/",
          "source": "PubMed",
          "relevance_score": 3.8,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "AJNR. American journal of neuroradiology",
          "volume": "",
          "issue": "",
          "pmid": "40957691",
          "doi": "10.3174/ajnr.A9000",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Association of DTI-ALPS Glymphatic Index With Differential Phenoconversion in Isolated REM Sleep Behavior Disorder: A Multi-Cohort MRI Study.",
          "authors": "Violette Ayral, Alexandre Pastor-Bernier, Véronique Daneault...",
          "abstract": "Isolated REM sleep behavior disorder (iRBD) is the strongest prodromal marker of synucleinopathies, including Parkinson disease (PD) and dementia with Lewy bodies (DLB). Identifying brain biomarkers that predict progression and distinguish phenoconversion trajectories remains a challenge. The glymphatic system is involved in interstitial waste clearance, and its dysfunction has been associated with pathologic protein accumulation and neurodegeneration. Diffusion tensor imaging along the perivascular space (DTI-ALPS) has been proposed as a noninvasive proxy for glymphatic function. The aim of this study was to determine whether patients with iRBD show a reduced DTI-ALPS index compared with controls and whether a lower DTI-ALPS index predicts future phenoconversion to PD or DLB.",
          "published": "2025-10-07",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956987/",
          "source": "PubMed",
          "relevance_score": 3.7,
          "matched_keywords": [
            "MRI",
            "dementia",
            "brain"
          ],
          "journal": "Neurology",
          "volume": "105",
          "issue": "7",
          "pmid": "40956987",
          "doi": "10.1212/WNL.0000000000214042",
          "categories": [
            "PubMed",
            "Humans",
            "REM Sleep Behavior Disorder",
            "Male",
            "Female",
            "Aged"
          ]
        },
        {
          "title": "Environmental noise exposure and a new biomarker of Alzheimer's disease: A pilot study.",
          "authors": "Jonghun Lee, Cheol-Woon Kim, Youjin Kim...",
          "abstract": "BackgroundEnvironmental noise pollution is increasingly recognized as a contributor to neurodegenerative processes, yet its relationship with early Alzheimer's disease biomarkers remains unclear.ObjectiveThis pilot study aimed to assess the feasibility of using gray-to-white matter signal intensity contrast (GWC) as a potential biomarker to explore associations between environmental noise exposure and early neurodegenerative changes.MethodsA total of 106 participants (mean age 35.97 ± 9.21 years, range 20-55), without cognitive impairment or neurological disorders, were included. Environmental noise levels were estimated using spatial interpolation from the National Noise Information System. Based on WHO guidelines (>60 dB daytime or >55 dB nighttime), participants were categorized into high- and low-noise groups. Whole-brain and regional GWC values were derived from 3D T1-weighted MRI using FreeSurfer. Correlations between noise exposure and GWC were analyzed with Pearson's correlation.ResultsThe high-noise group exhibited elevated whole-brain GWC values (20.11 ± 0.93) compared with the low-noise group (19.68 ± 0.96; p = 0.036). Regional analyses revealed higher GWC in the superior frontal gyrus, precentral gyrus, and paracentral lobules (all p < 0.05, FDR corrected). Nighttime noise exposure correlated more strongly with increased GWC (r = 0.203, p = 0.037) than daytime exposure.ConclusionsThis pilot study provides preliminary evidence of an association between environmental noise-particularly nighttime exposure-and subtle structural brain changes, as indicated by elevated GWC values. These findings suggest a potential neurobiological pathway linking noise exposure to early markers of neurodegeneration, warranting validation in larger, longitudinal studies.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956922/",
          "source": "PubMed",
          "relevance_score": 3.7,
          "matched_keywords": [
            "Alzheimer's disease",
            "MRI",
            "brain"
          ],
          "journal": "Journal of Alzheimer's disease : JAD",
          "volume": "",
          "issue": "",
          "pmid": "40956922",
          "doi": "10.1177/13872877251376920",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Characteristics of brain structural damage related to cerebral small vessel disease in general population with intracranial artery stenosis.",
          "authors": "Zi-Ang Pan, Zi-Yue Liu, Xing-Qi Pan...",
          "abstract": "Covert MRI markers of cerebral small vessel disease (CSVD) can coexist with large artery atherosclerosis. We aimed to explore whether the spatial distributions of these markers were diverse in people with or without intracranial artery stenosis (ICAS).",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40957669/",
          "source": "PubMed",
          "relevance_score": 2.7,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "Stroke and vascular neurology",
          "volume": "",
          "issue": "",
          "pmid": "40957669",
          "doi": "10.1136/svn-2025-004471",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Multi-epigenome-wide analyses and meta-analysis of child maltreatment in judicial autopsies and intervened children and adolescents.",
          "authors": "Shota Nishitani, Takashi X Fujisawa, Shinichiro Takiguchi...",
          "abstract": "Child maltreatment (CM) is associated with adverse physical, psychological, and neurodevelopmental outcomes later in life. Epigenetic modifications, particularly DNA methylation, have been proposed as potential mechanisms underlying these long-term effects. To identify robust CM-associated methylation signatures, we conducted epigenome-wide analyses across three independent cohorts: judicial autopsy cases (CM:11, Controls:7), toddlers shortly after social intervention (CM:36, Controls:49), and adolescents who underwent brain MRI (CM:61, Controls:62). Each cohort was analyzed separately, followed by a meta-analysis to identify common methylation sites associated with CM exposure. The meta-analysis identified four significant CpG sites located within the ATE1, SERPINB9P1, CHST11, and FOXP1 genes. Among these, methylation of FOXP1 was consistently associated with structural brain alterations, including increased gray matter volume (GMV) in the orbitofrontal cortex (OFrC) and middle/posterior cingulate gyrus (MPCG), and decreased GMV in the occipital fusiform gyrus (OFuG). These brain regions are implicated in emotional regulation, memory retrieval, and social cognition, suggesting a potential neurobiological mechanism linking CM to later psychopathology. Furthermore, methylation risk scores (MRS) derived from these four CpGs successfully discriminated individuals who experienced early-life adversity in an independent validation dataset, achieving an area under the receiver operating characteristic curve (AUC) of 0.672, highlighting their potential utility as biomarkers. Gene ontology and pathway analyses revealed enrichment of cholinergic and glutamatergic synaptic transmission pathways, supporting their involvement in traumatic memory formation. Our findings provide novel insights into the epigenetic mechanisms underlying CM and identify potential biomarkers for early detection, prevention, and therapeutic intervention, ultimately contributing to breaking the intergenerational cycle of maltreatment.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40957904/",
          "source": "PubMed",
          "relevance_score": 2.5,
          "matched_keywords": [
            "MRI",
            "brain"
          ],
          "journal": "Molecular psychiatry",
          "volume": "",
          "issue": "",
          "pmid": "40957904",
          "doi": "10.1038/s41380-025-03236-1",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "The Influence of POPC as a Coaggregate in Amyloid-β Oligomer Formation.",
          "authors": "Kelsie M King, Emma M Cleveland, Allison Pennington...",
          "abstract": "Alzheimer's Disease (AD) progresses with the formation of neuronal plaques composed primarily of the 42-residue alloform of amyloid-β (Aβ",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40957712/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid"
          ],
          "journal": "ACS chemical neuroscience",
          "volume": "",
          "issue": "",
          "pmid": "40957712",
          "doi": "10.1021/acschemneuro.5c00605",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Pharmacological strategies for managing dementia with Lewy Bodies: an expert review of symptom-targeted care.",
          "authors": "Oluwatosin Atewogboye, John Paul Taylor, Judith R Harrison",
          "abstract": "Dementia with Lewy Bodies (DLB) is the second most common cause of neurodegenerative dementia after Alzheimer's disease, characterized by a complex combination of cognitive, neuropsychiatric, motor, autonomic, and sleep-related symptoms. Symptom fluctuation, polypharmacy risks, and high sensitivity to commonly used drugs present unique challenges in its management.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40955908/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "dementia"
          ],
          "journal": "Expert review of clinical pharmacology",
          "volume": "",
          "issue": "",
          "pmid": "40955908",
          "doi": "10.1080/17512433.2025.2562151",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Application of Mendelian Randomization Analysis on the Exploration of the Association Between Immune Cell Phenotypes and Alzheimer's disease.",
          "authors": "Jia Guo, Han Zhang, Zhengguang Geng...",
          "abstract": "This study explores the correlation between immune inflammation and Alzheimer's disease (AD), focusing on immune-brain interactions impacting neurodevelopment and function.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40955699/",
          "source": "PubMed",
          "relevance_score": 2.2,
          "matched_keywords": [
            "Alzheimer's disease",
            "brain"
          ],
          "journal": "The Journal of nervous and mental disease",
          "volume": "",
          "issue": "",
          "pmid": "40955699",
          "doi": "10.1097/NMD.0000000000001851",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Unraveling the structural dynamics of A",
          "authors": "Kui Xia, Weixing Tian, Huifang Xu...",
          "abstract": "Alzheimer's disease is a degenerative disease of the central nervous system that pre-dominantly affects the elderly population. The main reason is that amyloid beta 42 has a strong tendency to aggregate, which easily induces the damage to the central nervous system. It was shown that residues 16 and 28 play a key role in the self-assembly process. Moreover, these studies have revealed that substituting alanine for these residues can weaken the toxicity of A",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40955736/",
          "source": "PubMed",
          "relevance_score": 2.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "amyloid"
          ],
          "journal": "Journal of biomolecular structure & dynamics",
          "volume": "",
          "issue": "",
          "pmid": "40955736",
          "doi": "10.1080/07391102.2025.2554351",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "CLAW-MRM:",
          "authors": "Connor Beveridge, Sanjay Iyer, Caitlin E Randolph...",
          "abstract": "Lipidomic profiling generates vast datasets, making manual annotation and trend interpretation complex and time-intensive. The structural and chemical diversity of the lipidome further complicates the analysis. While existing tools support targeted lipid identification, they often lack automated workflows and seamless integration with statistical and bioinformatics tools. Here, we introduce the comprehensive lipidomics automated workflow for multiple reaction monitoring (CLAW-MRM), a platform designed to automate lipid annotation, statistical analysis, and data parsing using custom multiple reaction monitoring (MRM) precursor product ion transitions. CLAW-MRM employs trimmed mean of m-value (TMM) normalization to account for lipid load differences, enabling robust cross-sample comparisons. To evaluate CLAW-MRM's performance, we analyzed lipid profiles in liver tissues of Alzheimer's disease (AD) mice and age-matched wild-type controls under conditions of constant and variable tissue mass, assessing the impact of normalization strategies on TMM-normalized lipidomic outcomes. Additionally, we isolated and profiled lipid droplets from individual brain regions of 18- to 24-month-old AD male mice and controls, leveraging nearly 1,500 MRM transitions across 11 lipid classes. Enhancing biological relevance, CLAW-MRM integrates LIGER (lipidome gene enrichment reactions), linking lipid expression with gene activation and suppression patterns. Through CLAW-MRM-based LIGER, we identified metabolic pathways enriched in differentially expressed lipids, offering insights into altered lipid metabolism in AD. To improve usability, CLAW-MRM incorporates a natural language interface powered by large language models, enabling artificial intelligence (AI)-driven user interaction for statistical and bioinformatics analyses. By automating lipid structural identification and integrating AI-assisted bioinformatics, CLAW-MRM provides an end-to-end workflow from data acquisition to interpretation, streamlining high-throughput lipidomics.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40892027/",
          "source": "PubMed",
          "relevance_score": 2.0,
          "matched_keywords": [
            "Alzheimer's disease",
            "brain"
          ],
          "journal": "Analytical chemistry",
          "volume": "97",
          "issue": "36",
          "pmid": "40892027",
          "doi": "10.1021/acs.analchem.4c05039",
          "categories": [
            "PubMed",
            "Lipidomics",
            "Animals",
            "Mice",
            "Workflow",
            "Lipids"
          ]
        },
        {
          "title": "Cross-modality transformer model leveraging DCE-MRI and pathological images for predicting pathological complete response and lymph node metastasis in breast cancer.",
          "authors": "Ming Fan, Zhiwei Zhu, Zhou Yu...",
          "abstract": "Pathological diagnosis remains the gold standard for diagnosing breast cancer and is highly accurate and sensitive, which is crucial for assessing pathological complete response (pCR) and lymph node metastasis (LNM) following neoadjuvant chemotherapy (NACT). Dynamic contrast-enhanced MRI (DCE-MRI) is a noninvasive technique that provides detailed morphological and functional insights into tumors. The optimal complementarity of these two modalities, particularly in situations where one is unavailable, and their integration to enhance therapeutic predictions have not been fully explored.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40957428/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Physics in medicine and biology",
          "volume": "",
          "issue": "",
          "pmid": "40957428",
          "doi": "10.1088/1361-6560/ae077c",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "MRI characteristics of plantar fibromas: a large consecutive series from a tertiary care center with symptom analysis.",
          "authors": "Natalie Velez, Cindy Weinschenk, Anish Goel...",
          "abstract": "A plantar fibroma (PF) is a painful benign lesion in which fibrous tissues infiltrate the plantar aponeurosis. The largest study published to date on MRI characteristics of PF includes only 16 patients. The aim was to systematically evaluate MRI characteristics of PFs from the database of our tertiary care center imaged over a decade with patient symptom analysis.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40958075/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Skeletal radiology",
          "volume": "",
          "issue": "",
          "pmid": "40958075",
          "doi": "10.1007/s00256-025-05036-8",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Multiparametric MRI to stratify risk factors for hemorrhagic complications in inoperable glioblastomas following stereotactic needle biopsy.",
          "authors": "Matia Martucci, Claudia Tocilă-Mătășel, Luigi Ruscelli...",
          "abstract": "Histological confirmation of glioblastoma (GB) is essential for therapeutic planning, even in inoperable cases where stereotactic needle biopsy (STNB) is the only option. However, post-procedural bleeding remains a known risk. This study aimed to evaluate the association between MRI features of GB and hemorrhagic complications following STNB.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956428/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Neuroradiology",
          "volume": "",
          "issue": "",
          "pmid": "40956428",
          "doi": "10.1007/s00234-025-03769-w",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Limitations of MRI in differentiating solid and cystic components of craniopharyngiomas.",
          "authors": "Banu Karaalioğlu, Nazlı Çakıcı Öksüz, Veyselkarani İpek...",
          "abstract": "Craniopharyngiomas (CP) present with both solid and cystic structures in magnetic resonance imaging (MRI) studies. Contrary to MRI appearance, components described as cysts are not infrequently found as non-fluent structures during surgery. This study aims to address the discrepancy between radiology and surgery regarding the nature of these lesions and to evaluate them for their preoperative predictability.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956448/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Child's nervous system : ChNS : official journal of the International Society for Pediatric Neurosurgery",
          "volume": "41",
          "issue": "1",
          "pmid": "40956448",
          "doi": "10.1007/s00381-025-06941-y",
          "categories": [
            "PubMed",
            "Humans",
            "Craniopharyngioma",
            "Pituitary Neoplasms",
            "Magnetic Resonance Imaging",
            "Female"
          ]
        },
        {
          "title": "Concurrent AI assistance with LI-RADS classification for contrast enhanced MRI of focal hepatic nodules: a multi-reader, multi-case study.",
          "authors": "Xiang Qin, Lisheng Huang, Yuanfeng Wei...",
          "abstract": "The Liver Imaging Reporting and Data System (LI-RADS) assessment is subject to inter-reader variability. The present study aimed to evaluate the impact of an artificial intelligence (AI) system on the accuracy and inter-reader agreement of LI-RADS classification based on contrast-enhanced magnetic resonance imaging among radiologists with varying experience levels.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956310/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Abdominal radiology (New York)",
          "volume": "",
          "issue": "",
          "pmid": "40956310",
          "doi": "10.1007/s00261-025-05202-5",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Hepatocellular Carcinoma Surveillance: Operational and Environmental Impact of Abbreviated MRI Protocols.",
          "authors": "Sean A Woolen, Fayyaz Ahamed, Robert D MacDougall...",
          "abstract": "To assess the operational and environmental benefits of using an abbreviated protocol for hepatocellular carcinoma (HCC) surveillance.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956971/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "MRI"
          ],
          "journal": "Canadian Association of Radiologists journal = Journal l'Association canadienne des radiologistes",
          "volume": "",
          "issue": "",
          "pmid": "40956971",
          "doi": "10.1177/08465371251371567",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "ASO Visual Abstract: Accuracy of PET-CT to Assess the Extent of Nodal Disease in Patients with Clinical Stage III Melanoma Following Neoadjuvant Treatment.",
          "authors": "Ronen Stoff, Mariana Yalon, Matthew P Thorpe...",
          "abstract": "",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956529/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "PET"
          ],
          "journal": "Annals of surgical oncology",
          "volume": "",
          "issue": "",
          "pmid": "40956529",
          "doi": "10.1245/s10434-025-18370-x",
          "categories": [
            "PubMed"
          ]
        },
        {
          "title": "Advances in PET imaging of oxidative stress: tracer innovation, mechanistic insight, and translational potential.",
          "authors": "Taoqian Zhao, Jimmy S Patel, Chongzhao Ran...",
          "abstract": "Oxidative stress is a fundamental driver of pathophysiological processes across a broad spectrum of diseases, including neurodegeneration, cancer, cardiovascular injury, and inflammation. The recent emergence of molecular imaging strategies, particularly positron emission tomography (PET), has led to the development of radiotracers capable of selectively imaging reactive oxygen and nitrogen species in vivo. This review outlines the biology of oxidative stress, highlights key PET tracers targeting redox-related pathways, and explores their potential for non-invasive imaging to support early diagnosis, therapeutic monitoring, and personalized treatment of oxidative stress-related diseases.",
          "published": "2025-09-16",
          "arxiv_url": "https://pubmed.ncbi.nlm.nih.gov/40956410/",
          "source": "PubMed",
          "relevance_score": 1.7,
          "matched_keywords": [
            "PET"
          ],
          "journal": "European journal of nuclear medicine and molecular imaging",
          "volume": "",
          "issue": "",
          "pmid": "40956410",
          "doi": "10.1007/s00259-025-07505-7",
          "categories": [
            "PubMed"
          ]
        }
      ],
      "paper_count": 20
    }
  }
}