{
  "2026-02-19": [
    {
      "title": "Predicting onset of symptomatic Alzheimer's disease with plasma p-tau217 clocks.",
      "authors": "Kellen K Petersen, Marta Milà-Alomà, Yan Li...",
      "abstract": "Predicting not just if, but also when, cognitively unimpaired individuals are likely to develop onset of Alzheimer's disease (AD) symptoms would be useful to clinical trials and, eventually, clinical practice. Although clock models based on amyloid and tau positron emission tomography have shown promise in predicting the onset of AD symptoms, a model based on plasma biomarkers would be more accessible. Using longitudinal plasma %p-tau217 (the ratio of phosphorylated to non-phosphorylated tau at position 217) from two independent cohorts (n = 258 and n = 345), clock models were used to estimate the age at plasma %p-tau217 positivity. The estimated age at plasma %p-tau217 positivity was associated with the age at onset of AD symptoms (adjusted R",
      "published": "2026-02-19",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41714746/",
      "source": "PubMed",
      "relevance_score": 23.1,
      "matched_keywords": [
        "Alzheimer's disease",
        "amyloid",
        "tau",
        "plasma"
      ],
      "journal": "Nature medicine",
      "volume": "",
      "issue": "",
      "is_high_impact": true,
      "archived_at": "2026-02-19T22:21:30.363672"
    },
    {
      "title": "Deep learning models identify brain changes during the progression of Alzheimer's disease.",
      "authors": "Jinhui Sun, Jing-Dong J Han, Weiyang Chen",
      "abstract": "Alzheimer's disease (AD) is an irreversible neurodegenerative disorder whose progression is closely associated with time. However, most diagnostic models are based on single time-point data, overlooking longitudinal disease characteristics. Structural magnetic resonance imaging (sMRI) has been widely utilized in the study of AD. To address the need for multi-time series analysis in longitudinal AD research and the integration of features from different brain tissues, we propose a Multi-Branch Fusion Channel Attention Network (MBFCA-Net) for disease diagnosis. This network leverages the temporal correlations across longitudinal scans for effective AD detection. We further conduct retrospective interpretability analysis to quantify the contributions of brain regions across disease stages. This enables a detailed investigation of dynamic changes in brain regions associated with AD and normal aging. The results indicate that the importance of regions such as the amygdala, parahippocampal gyrus, and temporal lobe undergoes dynamic changes throughout the progression of AD. Furthermore, AD-related voxel clusters exhibit a developmental trend, shifting from the hippocampus to the temporal lobe and transitioning from a dispersed to a more aggregated distribution. Our study provides novel insights into the longitudinal patterns of AD-related changes, offering valuable contributions to early diagnosis and pathological understanding of the disease.",
      "published": "2026-02-19",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41714635/",
      "source": "PubMed",
      "relevance_score": 15.6,
      "matched_keywords": [
        "Alzheimer's disease",
        "brain"
      ],
      "journal": "NPJ systems biology and applications",
      "volume": "",
      "issue": "",
      "is_high_impact": true,
      "archived_at": "2026-02-19T22:21:33.846821"
    }
  ],
  "2026-02-20": [
    {
      "title": "Hallucinations and delusions are associated with elevated tau PET signal independent of age, clinical severity, and amyloid burden.",
      "authors": "Aubrey S Johnson, Hannah Houlihan, Galen Ziaggi...",
      "abstract": "Psychosis in Alzheimer's disease (AD) is associated with worse outcomes, yet no established biomarkers exist for early diagnosis and intervention. We compared tau positron emission tomography (PET) burden across older individuals with and without psychotic symptoms.",
      "published": "2026-01-01",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41696647/",
      "source": "PubMed",
      "relevance_score": 24.2,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "tau"
      ],
      "journal": "Alzheimer's & dementia (Amsterdam, Netherlands)",
      "volume": "18",
      "issue": "1",
      "is_high_impact": true,
      "archived_at": "2026-02-20T11:11:36.516309"
    },
    {
      "title": "Refining Alzheimer's disease biological diagnosis with plasma biomarkers: Resolving p-tau217 \"gray zone\" with p-tau181 integration.",
      "authors": "Giulia Giacomucci, Silvia Maria Rita Tabbì, Assunta Ingannato...",
      "abstract": "Blood-based biomarkers offer a less invasive and more scalable alternative to cerebrospinal fluid (CSF) analysis and amyloid-positron emission tomography (PET) for the biological diagnosis of Alzheimer's disease (AD). Among blood-based biomarkers (BBMs), plasma phosphorylated tau217 (p-tau217) has shown the highest accuracy, although intermediate (\"gray zone\") values remain challenging to interpret.",
      "published": "2026-01-01",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41700306/",
      "source": "PubMed",
      "relevance_score": 20.6,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "plasma"
      ],
      "journal": "Alzheimer's & dementia (Amsterdam, Netherlands)",
      "volume": "18",
      "issue": "1",
      "is_high_impact": true,
      "archived_at": "2026-02-20T11:11:52.476958"
    },
    {
      "title": "Clinical amyloid and tau positron emission tomography imaging in Alzheimer's disease: image interpretation in the era of anti-amyloid therapies.",
      "authors": "Gregory Mathoux, Elif Harput, Débora E Peretti...",
      "abstract": "The introduction of disease-modifying anti-amyloid therapies has shifted the role of positron emission tomography (PET) imaging in Alzheimer's disease from confirming diagnosis to actively guiding clinical decision-making within the AT(N) framework.",
      "published": "2026-02-20",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41715292/",
      "source": "PubMed",
      "relevance_score": 16.2,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "tau"
      ],
      "journal": "Current opinion in neurology",
      "volume": "",
      "issue": "",
      "is_high_impact": false,
      "archived_at": "2026-02-20T11:12:15.914525"
    }
  ],
  "2026-02-24": [
    {
      "title": "ACR Appropriateness Criteria® Evaluation of Cardiac Masses.",
      "authors": "Prabhakar Shantha Rajiah, Kate Hanneman, Bradley D Allen...",
      "abstract": "This document discusses the appropriateness of imaging modalities for cardiac masses under 3 variants: 1) adult with suspected cardiac mass, initial imaging; 2) adult with known cardiac mass in echocardiography of unknown etiology, next imaging; and 3) adult with known cardiac mass and established etiology, follow-up imaging. US echocardiography transthoracic resting, MRI heart function and morphology without and with contrast, and CT heart function and morphology with contrast are usually appropriate for Variant 1. US echocardiography transesophageal, US echocardiography transthoracic resting, MRI heart function and morphology without and with contrast, CT heart function and morphology with contrast, FDG-PET/CT heart, and FDG-PET/MRI heart are usually appropriate for Variant 2. US echocardiography transthoracic resting, MRI heart function and morphology without and with contrast, MRI heart function and morphology without contrast, CT heart function and morphology with contrast, and FDG-PET/MRI heart are usually appropriate for Variant 3. The American College of Radiology Appropriateness Criteria are evidence-based guidelines for specific clinical conditions that are reviewed annually by a multidisciplinary expert panel. The guideline development and revision process support the systematic analysis of the medical literature from peer reviewed journals. Established methodology principles such as Grading of Recommendations Assessment, Development, and Evaluation or GRADE are adapted to evaluate the evidence. The RAND/UCLA Appropriateness Method User Manual provides the methodology to determine the appropriateness of imaging and treatment procedures for specific clinical scenarios. In those instances where peer reviewed literature is lacking or equivocal, experts may be the primary evidentiary source available to formulate a recommendation.",
      "published": "2026-02-20",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41721806/",
      "source": "PubMed",
      "relevance_score": 14.4,
      "matched_keywords": [
        "PET",
        "MRI"
      ],
      "journal": "Journal of the American College of Radiology : JACR",
      "volume": "",
      "issue": "",
      "is_high_impact": true,
      "archived_at": "2026-02-24T20:57:02.068129"
    }
  ],
  "2026-02-26": [
    {
      "title": "Modelling the temporal evolution of plasma p-tau217, amyloid PET, tau PET and cognition.",
      "authors": "Petrice M Cogswell, Emily S Lundt, Terry M Therneau...",
      "abstract": "Associations of Alzheimer's disease biomarker progression with cognitive decline are important to inform patient prognosis. Of particular interest is how newly available plasma biomarkers evolve relative to cognitive decline. The goals of this work are to measure how much earlier vs later an individual's progression on plasma and PET Alzheimer's disease biomarkers is associated with earlier vs later cognitive progression and to estimate the average timeline of progression of these processes in the population. In this cohort study of 2369 Mayo Clinic Study of Aging (MCSA) and 1591 Alzheimer's Disease Neuroimaging Initiative (ADNI) participants, we fit non-linear mixed effects models to estimate how much earlier vs later each individual progresses on plasma p-tau217, amyloid PET, tau PET, and auditory verbal learning test (AVLT) sum of trials relative to the population mean (individual adjustment), the associations of these individual adjustments among biomarker pairs, and how covariates affect the timing of biomarker progression. The association of individual adjustments implies mechanistic associations and the amount of variability in cognitive decline accounted for by each biomarker. By applying cutpoints, we also estimated the relative timing that these biomarkers become abnormal in the population. Associations of individual adjustments were moderate between all biomarkers and AVLT (R=0.38-0.47) in the MCSA and stronger (R=0.74-0.81) in ADNI; plasma p-tau217 accounted for 16% of the variability in timing of AVLT decline in the MCSA and 64% in ADNI. APOE ɛ4 carriership was associated with earlier biomarker progression. AVLT became abnormal after the biomarkers up to age 90, after which AVLT was estimated to become abnormal prior to tau biomarkers. The association of the timing of plasma and PET AD biomarker progression with cognitive decline was modest in the MCSA population-based sample and stronger in the Alzheimer's disease-enriched ADNI cohort. The timing of plasma p-tau217 progression explained a similar degree of variability in AVLT progression as amyloid PET, supporting its utility as a marker of disease progression. The estimated temporal ordering of biomarkers and cognitive abnormality was as anticipated (amyloid, tau, cognition) up to the age of 90, beyond which AVLT was estimated to become abnormal prior to tau biomarkers, likely related to the effects of non-Alzheimer's disease co-pathologies.",
      "published": "2026-02-25",
      "url": "https://pubmed.ncbi.nlm.nih.gov/41738322/",
      "source": "PubMed",
      "relevance_score": 32.3,
      "matched_keywords": [
        "Alzheimer's disease",
        "PET",
        "amyloid",
        "tau",
        "plasma"
      ],
      "journal": "Brain : a journal of neurology",
      "volume": "",
      "issue": "",
      "is_high_impact": true,
      "archived_at": "2026-02-26T11:42:49.803711"
    }
  ]
}